//PNB0079  JOB (ACCT),'PACIFIC NATL BANK',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,TIME=(,30)
//*
//* ============================================================
//* JCL for batch job PNB0079 — Generated
//* ============================================================
//*
//STEP00   EXEC PGM=EODSTUDV00,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0079,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP01   EXEC PGM=EODCHECV01,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0079,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP02   EXEC PGM=EODIRAV02,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0079,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP03   EXEC PGM=EODSTUDV03,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0079,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0079,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//CHKRC    IF (STEP00.RC GT 4) THEN
//NOTIFY   EXEC PGM=IEFBR14
//         ENDIF
//
