//PNB0034  JOB (ACCT),'PACIFIC NATL BANK',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,TIME=(,30)
//*
//* ============================================================
//* JCL for batch job PNB0034 — Generated
//* ============================================================
//*
//STEP00   EXEC PGM=EODMONEV00,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP01   EXEC PGM=EODSAVIV01,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP02   EXEC PGM=EODCOMMV02,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP03   EXEC PGM=EODCDV03,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP04   EXEC PGM=EODMONEV04,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP05   EXEC PGM=EODSAVIV05,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP06   EXEC PGM=EODCDV06,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//STEP07   EXEC PGM=EODCDV07,
//         REGION=0M,PARM='BATCH'
//STEPLIB  DD DSN=PNB.PROD.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD DSN=PNB.PROD.DATA.ACCT0034,
//         DISP=SHR
//OUTPUT   DD DSN=PNB.PROD.DATA.OUT0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//REPORT   DD DSN=PNB.PROD.REPORT.R0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(10,5),RLSE)
//ERRFILE  DD DSN=PNB.PROD.ERRORS.E0034,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,(5,2),RLSE)
//*
//CHKRC    IF (STEP00.RC GT 4) THEN
//NOTIFY   EXEC PGM=IEFBR14
//         ENDIF
//
