*********************************************************************
* MFS for MFSALERV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV08M  MSG   TYPE=INPUT,SOR=(MFSALERV08I,IGNORE),
               NXT=MFSALERV08O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=L
         MFLD  'FLD010',LTH=40,
               JUST=L
         MFLD  'FLD011',LTH=16,
               JUST=L
         MFLD  'FLD012',LTH=12,
               JUST=R
         MSGEND
*
MFSALERV08O  MSG   TYPE=OUTPUT,SOR=(MFSALERV08D,IGNORE),
               NXT=MFSALERV08M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=16
         MFLD  'FLD012',LTH=12
         MSGEND
*
MFSALERV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(3,55),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(4,17),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=12,
               POS=(4,35),ATTR=(PROT,NUM)
         FMTEND
         END
