*********************************************************************
* MFS for MFSACHDV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACHDV00M  MSG   TYPE=INPUT,SOR=(MFSACHDV00I,IGNORE),
               NXT=MFSACHDV00O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=L
         MSGEND
*
MFSACHDV00O  MSG   TYPE=OUTPUT,SOR=(MFSACHDV00D,IGNORE),
               NXT=MFSACHDV00M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MSGEND
*
MFSACHDV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,27),ATTR=(PROT,NUM)
         FMTEND
         END
