*********************************************************************
* MFS for MFSALERV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV05M  MSG   TYPE=INPUT,SOR=(MFSALERV05I,IGNORE),
               NXT=MFSALERV05O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=R
         MFLD  'FLD009',LTH=40,
               JUST=L
         MSGEND
*
MFSALERV05O  MSG   TYPE=OUTPUT,SOR=(MFSALERV05D,IGNORE),
               NXT=MFSALERV05M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=40
         MSGEND
*
MFSALERV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,41),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(3,51),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,63),ATTR=(PROT,NUM)
         FMTEND
         END
