*********************************************************************
* MFS for MFSALERV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV06M  MSG   TYPE=INPUT,SOR=(MFSALERV06I,IGNORE),
               NXT=MFSALERV06O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=8,
               JUST=L
         MFLD  'FLD010',LTH=10,
               JUST=R
         MSGEND
*
MFSALERV06O  MSG   TYPE=OUTPUT,SOR=(MFSALERV06D,IGNORE),
               NXT=MFSALERV06M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=8
         MFLD  'FLD010',LTH=10
         MSGEND
*
MFSALERV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,13),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,3),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,35),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=8,
               POS=(3,67),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,77),ATTR=(PROT,NUM)
         FMTEND
         END
