*********************************************************************
* MFS for MFSACCTV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACCTV04M  MSG   TYPE=INPUT,SOR=(MFSACCTV04I,IGNORE),
               NXT=MFSACCTV04O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=R
         MSGEND
*
MFSACCTV04O  MSG   TYPE=OUTPUT,SOR=(MFSACCTV04D,IGNORE),
               NXT=MFSACCTV04M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=30
         MSGEND
*
MFSACCTV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,13),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,67),ATTR=(PROT,NUM)
         FMTEND
         END
