*********************************************************************
* MFS for MFSACHDV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACHDV09M  MSG   TYPE=INPUT,SOR=(MFSACHDV09I,IGNORE),
               NXT=MFSACHDV09O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=L
         MFLD  'FLD008',LTH=12,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=30,
               JUST=R
         MFLD  'FLD011',LTH=30,
               JUST=L
         MFLD  'FLD012',LTH=8,
               JUST=R
         MFLD  'FLD013',LTH=40,
               JUST=R
         MSGEND
*
MFSACHDV09O  MSG   TYPE=OUTPUT,SOR=(MFSACHDV09D,IGNORE),
               NXT=MFSACHDV09M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=30
         MFLD  'FLD011',LTH=30
         MFLD  'FLD012',LTH=8
         MFLD  'FLD013',LTH=40
         MSGEND
*
MFSACHDV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(2,71),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=30,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(3,55),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=8,
               POS=(4,7),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=40,
               POS=(4,17),ATTR=(PROT,NUM)
         FMTEND
         END
