*********************************************************************
* MFS for MFSALERV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV04M  MSG   TYPE=INPUT,SOR=(MFSALERV04I,IGNORE),
               NXT=MFSALERV04O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=L
         MSGEND
*
MFSALERV04O  MSG   TYPE=OUTPUT,SOR=(MFSALERV04D,IGNORE),
               NXT=MFSALERV04M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=10
         MSGEND
*
MFSALERV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(2,67),ATTR=(PROT,NUM)
         FMTEND
         END
