*********************************************************************
* MFS for MFSALERV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV01M  MSG   TYPE=INPUT,SOR=(MFSALERV01I,IGNORE),
               NXT=MFSALERV01O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MSGEND
*
MFSALERV01O  MSG   TYPE=OUTPUT,SOR=(MFSALERV01D,IGNORE),
               NXT=MFSALERV01M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=20
         MSGEND
*
MFSALERV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,27),ATTR=(PROT,NUM)
         FMTEND
         END
