*********************************************************************
* MFS for MFSALERV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV10M  MSG   TYPE=INPUT,SOR=(MFSALERV10I,IGNORE),
               NXT=MFSALERV10O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MSGEND
*
MFSALERV10O  MSG   TYPE=OUTPUT,SOR=(MFSALERV10D,IGNORE),
               NXT=MFSALERV10M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=8
         MSGEND
*
MFSALERV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,35),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,19),ATTR=(PROT,NUM)
         FMTEND
         END
