*********************************************************************
* MFS for MFSALERV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV02M  MSG   TYPE=INPUT,SOR=(MFSALERV02I,IGNORE),
               NXT=MFSALERV02O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=L
         MSGEND
*
MFSALERV02O  MSG   TYPE=OUTPUT,SOR=(MFSALERV02D,IGNORE),
               NXT=MFSALERV02M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSALERV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,55),ATTR=(PROT,NUM)
         FMTEND
         END
