*********************************************************************
* MFS for MFSAUDIV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV08M  MSG   TYPE=INPUT,SOR=(MFSAUDIV08I,IGNORE),
               NXT=MFSAUDIV08O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=R
         MFLD  'FLD010',LTH=12,
               JUST=L
         MFLD  'FLD011',LTH=40,
               JUST=L
         MFLD  'FLD012',LTH=10,
               JUST=R
         MSGEND
*
MFSAUDIV08O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV08D,IGNORE),
               NXT=MFSAUDIV08M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=40
         MFLD  'FLD012',LTH=10
         MSGEND
*
MFSAUDIV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,53),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=40,
               POS=(3,67),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=10,
               POS=(4,29),ATTR=(PROT,NUM)
         FMTEND
         END
