*********************************************************************
* MFS for MFSAUDIV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV05M  MSG   TYPE=INPUT,SOR=(MFSAUDIV05I,IGNORE),
               NXT=MFSAUDIV05O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MSGEND
*
MFSAUDIV05O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV05D,IGNORE),
               NXT=MFSAUDIV05M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=10
         MSGEND
*
MFSAUDIV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,73),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,25),ATTR=(PROT,NUM)
         FMTEND
         END
