*********************************************************************
* MFS for MFSACCTV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACCTV13M  MSG   TYPE=INPUT,SOR=(MFSACCTV13I,IGNORE),
               NXT=MFSACCTV13O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=L
         MSGEND
*
MFSACCTV13O  MSG   TYPE=OUTPUT,SOR=(MFSACCTV13D,IGNORE),
               NXT=MFSACCTV13M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=10
         MSGEND
*
MFSACCTV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(2,67),ATTR=(PROT,NUM)
         FMTEND
         END
