*********************************************************************
* MFS for MFSAUDIV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV03M  MSG   TYPE=INPUT,SOR=(MFSAUDIV03I,IGNORE),
               NXT=MFSAUDIV03O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=R
         MSGEND
*
MFSAUDIV03O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV03D,IGNORE),
               NXT=MFSAUDIV03M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=16
         MSGEND
*
MFSAUDIV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,69),ATTR=(PROT,NUM)
         FMTEND
         END
