*********************************************************************
* MFS for MFSALERV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV13M  MSG   TYPE=INPUT,SOR=(MFSALERV13I,IGNORE),
               NXT=MFSALERV13O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MSGEND
*
MFSALERV13O  MSG   TYPE=OUTPUT,SOR=(MFSALERV13D,IGNORE),
               NXT=MFSALERV13M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSALERV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,17),ATTR=(PROT,NUM)
         FMTEND
         END
