*********************************************************************
* MFS for MFSALERV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV07M  MSG   TYPE=INPUT,SOR=(MFSALERV07I,IGNORE),
               NXT=MFSALERV07O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=10,
               JUST=L
         MFLD  'FLD010',LTH=16,
               JUST=R
         MFLD  'FLD011',LTH=20,
               JUST=L
         MSGEND
*
MFSALERV07O  MSG   TYPE=OUTPUT,SOR=(MFSALERV07D,IGNORE),
               NXT=MFSALERV07M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=16
         MFLD  'FLD011',LTH=20
         MSGEND
*
MFSALERV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,59),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,37),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=20,
               POS=(3,67),ATTR=(PROT,NUM)
         FMTEND
         END
