*********************************************************************
* MFS for MFSAUDIV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV14M  MSG   TYPE=INPUT,SOR=(MFSAUDIV14I,IGNORE),
               NXT=MFSAUDIV14O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=L
         MSGEND
*
MFSAUDIV14O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV14D,IGNORE),
               NXT=MFSAUDIV14M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSAUDIV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(2,53),ATTR=(PROT,NUM)
         FMTEND
         END
