*********************************************************************
* MFS for MFSALERV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV12M  MSG   TYPE=INPUT,SOR=(MFSALERV12I,IGNORE),
               NXT=MFSALERV12O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MSGEND
*
MFSALERV12O  MSG   TYPE=OUTPUT,SOR=(MFSALERV12D,IGNORE),
               NXT=MFSALERV12M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=8
         MSGEND
*
MFSALERV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(3,9),ATTR=(PROT,NUM)
         FMTEND
         END
