*********************************************************************
* MFS for MFSACCTV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACCTV06M  MSG   TYPE=INPUT,SOR=(MFSACCTV06I,IGNORE),
               NXT=MFSACCTV06O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=16,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=20,
               JUST=L
         MSGEND
*
MFSACCTV06O  MSG   TYPE=OUTPUT,SOR=(MFSACCTV06D,IGNORE),
               NXT=MFSACCTV06M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=16
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=20
         MSGEND
*
MFSACCTV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,51),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(3,41),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,59),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=20,
               POS=(4,11),ATTR=(PROT,NUM)
         FMTEND
         END
