*********************************************************************
* MFS for MFSAUDIV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV04M  MSG   TYPE=INPUT,SOR=(MFSAUDIV04I,IGNORE),
               NXT=MFSAUDIV04O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=R
         MSGEND
*
MFSAUDIV04O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV04D,IGNORE),
               NXT=MFSAUDIV04M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSAUDIV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,73),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
