*********************************************************************
* MFS for MFSACCTV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACCTV02M  MSG   TYPE=INPUT,SOR=(MFSACCTV02I,IGNORE),
               NXT=MFSACCTV02O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=L
         MSGEND
*
MFSACCTV02O  MSG   TYPE=OUTPUT,SOR=(MFSACCTV02D,IGNORE),
               NXT=MFSACCTV02M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=30
         MSGEND
*
MFSACCTV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,57),ATTR=(PROT,NUM)
         FMTEND
         END
