*********************************************************************
* MFS for MFSACHDV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACHDV06M  MSG   TYPE=INPUT,SOR=(MFSACHDV06I,IGNORE),
               NXT=MFSACHDV06O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=L
         MFLD  'FLD008',LTH=12,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=30,
               JUST=R
         MSGEND
*
MFSACHDV06O  MSG   TYPE=OUTPUT,SOR=(MFSACHDV06D,IGNORE),
               NXT=MFSACHDV06M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=30
         MSGEND
*
MFSACHDV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,59),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(2,73),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=30,
               POS=(3,39),ATTR=(PROT,NUM)
         FMTEND
         END
