*********************************************************************
* MFS for MFSAUDIV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSAUDIV02M  MSG   TYPE=INPUT,SOR=(MFSAUDIV02I,IGNORE),
               NXT=MFSAUDIV02O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=R
         MSGEND
*
MFSAUDIV02O  MSG   TYPE=OUTPUT,SOR=(MFSAUDIV02D,IGNORE),
               NXT=MFSAUDIV02M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSAUDIV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,25),ATTR=(PROT,NUM)
         FMTEND
         END
