*********************************************************************
* MFS for MFSALERV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV03M  MSG   TYPE=INPUT,SOR=(MFSALERV03I,IGNORE),
               NXT=MFSALERV03O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MSGEND
*
MFSALERV03O  MSG   TYPE=OUTPUT,SOR=(MFSALERV03D,IGNORE),
               NXT=MFSALERV03M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=16
         MSGEND
*
MFSALERV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,39),ATTR=(PROT,NUM)
         FMTEND
         END
