*********************************************************************
* MFS for MFSALERV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSALERV04M  MSG   TYPE=INPUT,SOR=(MFSALERV04I,IGNORE),
               NXT=MFSALERV04O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=20,
               JUST=R
         MFLD  'FLD008',LTH=12,
               JUST=L
         MSGEND
*
MFSALERV04O  MSG   TYPE=OUTPUT,SOR=(MFSALERV04D,IGNORE),
               NXT=MFSALERV04M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=12
         MSGEND
*
MFSALERV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(3,27),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(3,49),ATTR=(PROT,NUM)
         FMTEND
         END
