*********************************************************************
* MFS for MFSACHDV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACHDV08M  MSG   TYPE=INPUT,SOR=(MFSACHDV08I,IGNORE),
               NXT=MFSACHDV08O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=10,
               JUST=R
         MFLD  'FLD010',LTH=40,
               JUST=L
         MFLD  'FLD011',LTH=8,
               JUST=R
         MFLD  'FLD012',LTH=40,
               JUST=R
         MSGEND
*
MFSACHDV08O  MSG   TYPE=OUTPUT,SOR=(MFSACHDV08D,IGNORE),
               NXT=MFSACHDV08M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=8
         MFLD  'FLD012',LTH=40
         MSGEND
*
MFSACHDV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,71),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(4,3),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=8,
               POS=(4,45),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=40,
               POS=(4,55),ATTR=(PROT,NUM)
         FMTEND
         END
