*********************************************************************
* MFS for MFSACHDV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSACHDV05M  MSG   TYPE=INPUT,SOR=(MFSACHDV05I,IGNORE),
               NXT=MFSACHDV05O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=R
         MFLD  'FLD007',LTH=40,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MSGEND
*
MFSACHDV05O  MSG   TYPE=OUTPUT,SOR=(MFSACHDV05D,IGNORE),
               NXT=MFSACHDV05M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=30
         MSGEND
*
MFSACHDV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,47),ATTR=(PROT,NUM)
         FMTEND
         END
