*********************************************************************
* MFS for MFSBRCHV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV04M  MSG   TYPE=INPUT,SOR=(MFSBRCHV04I,IGNORE),
               NXT=MFSBRCHV04O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=8,
               JUST=L
         MSGEND
*
MFSBRCHV04O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV04D,IGNORE),
               NXT=MFSBRCHV04M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSBRCHV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(2,59),ATTR=(PROT,NUM)
         FMTEND
         END
