*********************************************************************
* MFS for MFSBRCHV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV08M  MSG   TYPE=INPUT,SOR=(MFSBRCHV08I,IGNORE),
               NXT=MFSBRCHV08O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=12,
               JUST=R
         MFLD  'FLD010',LTH=20,
               JUST=L
         MFLD  'FLD011',LTH=30,
               JUST=R
         MFLD  'FLD012',LTH=30,
               JUST=R
         MSGEND
*
MFSBRCHV08O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV08D,IGNORE),
               NXT=MFSBRCHV08M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=20
         MFLD  'FLD011',LTH=30
         MFLD  'FLD012',LTH=30
         MSGEND
*
MFSBRCHV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=20,
               POS=(3,21),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(3,43),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=30,
               POS=(3,75),ATTR=(PROT,NUM)
         FMTEND
         END
