*********************************************************************
* MFS for MFSBRCHV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV11M  MSG   TYPE=INPUT,SOR=(MFSBRCHV11I,IGNORE),
               NXT=MFSBRCHV11O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=R
         MSGEND
*
MFSBRCHV11O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV11D,IGNORE),
               NXT=MFSBRCHV11M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=10
         MSGEND
*
MFSBRCHV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,31),ATTR=(PROT,NUM)
         FMTEND
         END
