*********************************************************************
* MFS for MFSBRCHV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV01M  MSG   TYPE=INPUT,SOR=(MFSBRCHV01I,IGNORE),
               NXT=MFSBRCHV01O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MSGEND
*
MFSBRCHV01O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV01D,IGNORE),
               NXT=MFSBRCHV01M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=30
         MSGEND
*
MFSBRCHV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,41),ATTR=(PROT,NUM)
         FMTEND
         END
