*********************************************************************
* MFS for MFSBRCHV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV11M  MSG   TYPE=INPUT,SOR=(MFSBRCHV11I,IGNORE),
               NXT=MFSBRCHV11O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MSGEND
*
MFSBRCHV11O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV11D,IGNORE),
               NXT=MFSBRCHV11M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=10
         MSGEND
*
MFSBRCHV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,9),ATTR=(PROT,NUM)
         FMTEND
         END
