*********************************************************************
* MFS for MFSBRCHV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV00M  MSG   TYPE=INPUT,SOR=(MFSBRCHV00I,IGNORE),
               NXT=MFSBRCHV00O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=R
         MSGEND
*
MFSBRCHV00O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV00D,IGNORE),
               NXT=MFSBRCHV00M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=20
         MSGEND
*
MFSBRCHV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,7),ATTR=(PROT,NUM)
         FMTEND
         END
