*********************************************************************
* MFS for MFSBRCHV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV01M  MSG   TYPE=INPUT,SOR=(MFSBRCHV01I,IGNORE),
               NXT=MFSBRCHV01O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=L
         MSGEND
*
MFSBRCHV01O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV01D,IGNORE),
               NXT=MFSBRCHV01M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=8
         MSGEND
*
MFSBRCHV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,69),ATTR=(PROT,NUM)
         FMTEND
         END
