*********************************************************************
* MFS for MFSBRCHV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV09M  MSG   TYPE=INPUT,SOR=(MFSBRCHV09I,IGNORE),
               NXT=MFSBRCHV09O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=16,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=L
         MFLD  'FLD010',LTH=8,
               JUST=L
         MFLD  'FLD011',LTH=10,
               JUST=R
         MFLD  'FLD012',LTH=40,
               JUST=L
         MFLD  'FLD013',LTH=10,
               JUST=R
         MSGEND
*
MFSBRCHV09O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV09D,IGNORE),
               NXT=MFSBRCHV09M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=16
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=8
         MFLD  'FLD011',LTH=10
         MFLD  'FLD012',LTH=40
         MFLD  'FLD013',LTH=10
         MSGEND
*
MFSBRCHV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,5),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(3,37),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(3,47),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=40,
               POS=(3,59),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=10,
               POS=(4,21),ATTR=(PROT,NUM)
         FMTEND
         END
