*********************************************************************
* MFS for MFSBRCHV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV10M  MSG   TYPE=INPUT,SOR=(MFSBRCHV10I,IGNORE),
               NXT=MFSBRCHV10O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=R
         MSGEND
*
MFSBRCHV10O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV10D,IGNORE),
               NXT=MFSBRCHV10M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=10
         MSGEND
*
MFSBRCHV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,73),ATTR=(PROT,NUM)
         FMTEND
         END
