*********************************************************************
* MFS for MFSBRCHV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV02M  MSG   TYPE=INPUT,SOR=(MFSBRCHV02I,IGNORE),
               NXT=MFSBRCHV02O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MSGEND
*
MFSBRCHV02O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV02D,IGNORE),
               NXT=MFSBRCHV02M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=16
         MSGEND
*
MFSBRCHV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,75),ATTR=(PROT,NUM)
         FMTEND
         END
