*********************************************************************
* MFS for MFSBRCHV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV09M  MSG   TYPE=INPUT,SOR=(MFSBRCHV09I,IGNORE),
               NXT=MFSBRCHV09O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=10,
               JUST=R
         MFLD  'FLD011',LTH=40,
               JUST=R
         MFLD  'FLD012',LTH=10,
               JUST=L
         MFLD  'FLD013',LTH=8,
               JUST=R
         MSGEND
*
MFSBRCHV09O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV09D,IGNORE),
               NXT=MFSBRCHV09M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=40
         MFLD  'FLD012',LTH=10
         MFLD  'FLD013',LTH=8
         MSGEND
*
MFSBRCHV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=40,
               POS=(3,29),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=10,
               POS=(3,71),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=8,
               POS=(4,3),ATTR=(PROT,NUM)
         FMTEND
         END
