*********************************************************************
* MFS for MFSBRCHV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV05M  MSG   TYPE=INPUT,SOR=(MFSBRCHV05I,IGNORE),
               NXT=MFSBRCHV05O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=16,
               JUST=R
         MSGEND
*
MFSBRCHV05O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV05D,IGNORE),
               NXT=MFSBRCHV05M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=16
         MSGEND
*
MFSBRCHV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,27),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=16,
               POS=(3,49),ATTR=(PROT,NUM)
         FMTEND
         END
