*********************************************************************
* MFS for MFSBRCHV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV07M  MSG   TYPE=INPUT,SOR=(MFSBRCHV07I,IGNORE),
               NXT=MFSBRCHV07O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=8,
               JUST=R
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=10,
               JUST=L
         MFLD  'FLD011',LTH=10,
               JUST=L
         MSGEND
*
MFSBRCHV07O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV07D,IGNORE),
               NXT=MFSBRCHV07M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=8
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=10
         MSGEND
*
MFSBRCHV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,45),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,63),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,73),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(4,35),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(4,47),ATTR=(PROT,NUM)
         FMTEND
         END
