*********************************************************************
* MFS for MFSBRCHV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV03M  MSG   TYPE=INPUT,SOR=(MFSBRCHV03I,IGNORE),
               NXT=MFSBRCHV03O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=L
         MSGEND
*
MFSBRCHV03O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV03D,IGNORE),
               NXT=MFSBRCHV03M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSBRCHV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,57),ATTR=(PROT,NUM)
         FMTEND
         END
