*********************************************************************
* MFS for MFSBRCHV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV06M  MSG   TYPE=INPUT,SOR=(MFSBRCHV06I,IGNORE),
               NXT=MFSBRCHV06O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=16,
               JUST=L
         MSGEND
*
MFSBRCHV06O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV06D,IGNORE),
               NXT=MFSBRCHV06M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=16
         MSGEND
*
MFSBRCHV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,19),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(4,13),ATTR=(PROT,NUM)
         FMTEND
         END
