*********************************************************************
* MFS for MFSBRCHV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV13M  MSG   TYPE=INPUT,SOR=(MFSBRCHV13I,IGNORE),
               NXT=MFSBRCHV13O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=R
         MSGEND
*
MFSBRCHV13O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV13D,IGNORE),
               NXT=MFSBRCHV13M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=8
         MSGEND
*
MFSBRCHV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,45),ATTR=(PROT,NUM)
         FMTEND
         END
