*********************************************************************
* MFS for MFSBRCHV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSBRCHV14M  MSG   TYPE=INPUT,SOR=(MFSBRCHV14I,IGNORE),
               NXT=MFSBRCHV14O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=L
         MFLD  'FLD008',LTH=8,
               JUST=L
         MSGEND
*
MFSBRCHV14O  MSG   TYPE=OUTPUT,SOR=(MFSBRCHV14D,IGNORE),
               NXT=MFSBRCHV14M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSBRCHV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
