*********************************************************************
* MFS for MFSCUSTV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV09M  MSG   TYPE=INPUT,SOR=(MFSCUSTV09I,IGNORE),
               NXT=MFSCUSTV09O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=12,
               JUST=R
         MFLD  'FLD009',LTH=8,
               JUST=L
         MFLD  'FLD010',LTH=30,
               JUST=R
         MFLD  'FLD011',LTH=10,
               JUST=L
         MFLD  'FLD012',LTH=10,
               JUST=L
         MFLD  'FLD013',LTH=8,
               JUST=L
         MSGEND
*
MFSCUSTV09O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV09D,IGNORE),
               NXT=MFSCUSTV09M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=8
         MFLD  'FLD010',LTH=30
         MFLD  'FLD011',LTH=10
         MFLD  'FLD012',LTH=10
         MFLD  'FLD013',LTH=8
         MSGEND
*
MFSCUSTV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(3,41),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=8,
               POS=(3,55),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=30,
               POS=(3,65),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(4,17),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=10,
               POS=(4,29),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=8,
               POS=(4,41),ATTR=(PROT,NUM)
         FMTEND
         END
