*********************************************************************
* MFS for MFSCUSTV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV06M  MSG   TYPE=INPUT,SOR=(MFSCUSTV06I,IGNORE),
               NXT=MFSCUSTV06O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MFLD  'FLD008',LTH=12,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=8,
               JUST=L
         MSGEND
*
MFSCUSTV06O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV06D,IGNORE),
               NXT=MFSCUSTV06M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=8
         MSGEND
*
MFSCUSTV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(3,57),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,71),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(4,23),ATTR=(PROT,NUM)
         FMTEND
         END
