*********************************************************************
* MFS for MFSCUSTV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV11M  MSG   TYPE=INPUT,SOR=(MFSCUSTV11I,IGNORE),
               NXT=MFSCUSTV11O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=R
         MSGEND
*
MFSCUSTV11O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV11D,IGNORE),
               NXT=MFSCUSTV11M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MSGEND
*
MFSCUSTV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,61),ATTR=(PROT,NUM)
         FMTEND
         END
