*********************************************************************
* MFS for MFSCUSTV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV01M  MSG   TYPE=INPUT,SOR=(MFSCUSTV01I,IGNORE),
               NXT=MFSCUSTV01O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=R
         MSGEND
*
MFSCUSTV01O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV01D,IGNORE),
               NXT=MFSCUSTV01M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=10
         MSGEND
*
MFSCUSTV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,31),ATTR=(PROT,NUM)
         FMTEND
         END
