*********************************************************************
* MFS for MFSCUSTV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV03M  MSG   TYPE=INPUT,SOR=(MFSCUSTV03I,IGNORE),
               NXT=MFSCUSTV03O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=20,
               JUST=L
         MSGEND
*
MFSCUSTV03O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV03D,IGNORE),
               NXT=MFSCUSTV03M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=20
         MSGEND
*
MFSCUSTV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,35),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
