*********************************************************************
* MFS for MFSCUSTV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV02M  MSG   TYPE=INPUT,SOR=(MFSCUSTV02I,IGNORE),
               NXT=MFSCUSTV02O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=30,
               JUST=R
         MSGEND
*
MFSCUSTV02O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV02D,IGNORE),
               NXT=MFSCUSTV02M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=30
         MSGEND
*
MFSCUSTV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,33),ATTR=(PROT,NUM)
         FMTEND
         END
