*********************************************************************
* MFS for MFSCARDV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV01M  MSG   TYPE=INPUT,SOR=(MFSCARDV01I,IGNORE),
               NXT=MFSCARDV01O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MSGEND
*
MFSCARDV01O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV01D,IGNORE),
               NXT=MFSCARDV01M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MSGEND
*
MFSCARDV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,35),ATTR=(PROT,NUM)
         FMTEND
         END
