*********************************************************************
* MFS for MFSCARDV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV08M  MSG   TYPE=INPUT,SOR=(MFSCARDV08I,IGNORE),
               NXT=MFSCARDV08O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=20,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=L
         MFLD  'FLD010',LTH=40,
               JUST=R
         MFLD  'FLD011',LTH=8,
               JUST=R
         MFLD  'FLD012',LTH=40,
               JUST=R
         MSGEND
*
MFSCARDV08O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV08D,IGNORE),
               NXT=MFSCARDV08M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=8
         MFLD  'FLD012',LTH=40
         MSGEND
*
MFSCARDV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(3,25),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(3,47),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,59),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(4,21),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=8,
               POS=(4,63),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=40,
               POS=(4,73),ATTR=(PROT,NUM)
         FMTEND
         END
