*********************************************************************
* MFS for MFSCUSTV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV05M  MSG   TYPE=INPUT,SOR=(MFSCUSTV05I,IGNORE),
               NXT=MFSCUSTV05O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MSGEND
*
MFSCUSTV05O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV05D,IGNORE),
               NXT=MFSCUSTV05M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=10
         MSGEND
*
MFSCUSTV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,77),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,53),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,71),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(4,33),ATTR=(PROT,NUM)
         FMTEND
         END
