*********************************************************************
* MFS for MFSCARDV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV07M  MSG   TYPE=INPUT,SOR=(MFSCARDV07I,IGNORE),
               NXT=MFSCARDV07O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=10,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=8,
               JUST=R
         MFLD  'FLD010',LTH=12,
               JUST=L
         MFLD  'FLD011',LTH=16,
               JUST=R
         MSGEND
*
MFSCARDV07O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV07D,IGNORE),
               NXT=MFSCARDV07M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=8
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=16
         MSGEND
*
MFSCARDV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,35),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=8,
               POS=(3,67),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,77),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(4,11),ATTR=(PROT,NUM)
         FMTEND
         END
