*********************************************************************
* MFS for MFSCARDV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV11M  MSG   TYPE=INPUT,SOR=(MFSCARDV11I,IGNORE),
               NXT=MFSCARDV11O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MSGEND
*
MFSCARDV11O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV11D,IGNORE),
               NXT=MFSCARDV11M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=12
         MSGEND
*
MFSCARDV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,37),ATTR=(PROT,NUM)
         FMTEND
         END
