*********************************************************************
* MFS for MFSCARDV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV00M  MSG   TYPE=INPUT,SOR=(MFSCARDV00I,IGNORE),
               NXT=MFSCARDV00O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MSGEND
*
MFSCARDV00O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV00D,IGNORE),
               NXT=MFSCARDV00M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=16
         MSGEND
*
MFSCARDV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,1),ATTR=(PROT,NUM)
         FMTEND
         END
