*********************************************************************
* MFS for MFSCARDV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV10M  MSG   TYPE=INPUT,SOR=(MFSCARDV10I,IGNORE),
               NXT=MFSCARDV10O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MSGEND
*
MFSCARDV10O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV10D,IGNORE),
               NXT=MFSCARDV10M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=10
         MSGEND
*
MFSCARDV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,31),ATTR=(PROT,NUM)
         FMTEND
         END
