*********************************************************************
* MFS for MFSCARDV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCARDV02M  MSG   TYPE=INPUT,SOR=(MFSCARDV02I,IGNORE),
               NXT=MFSCARDV02O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=L
         MSGEND
*
MFSCARDV02O  MSG   TYPE=OUTPUT,SOR=(MFSCARDV02D,IGNORE),
               NXT=MFSCARDV02M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=8
         MSGEND
*
MFSCARDV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,41),ATTR=(PROT,NUM)
         FMTEND
         END
