*********************************************************************
* MFS for MFSCUSTV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSCUSTV10M  MSG   TYPE=INPUT,SOR=(MFSCUSTV10I,IGNORE),
               NXT=MFSCUSTV10O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MSGEND
*
MFSCUSTV10O  MSG   TYPE=OUTPUT,SOR=(MFSCUSTV10D,IGNORE),
               NXT=MFSCUSTV10M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=16
         MSGEND
*
MFSCUSTV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,21),ATTR=(PROT,NUM)
         FMTEND
         END
