*********************************************************************
* MFS for MFSFEEDV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV13M  MSG   TYPE=INPUT,SOR=(MFSFEEDV13I,IGNORE),
               NXT=MFSFEEDV13O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=R
         MSGEND
*
MFSFEEDV13O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV13D,IGNORE),
               NXT=MFSFEEDV13M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=12
         MSGEND
*
MFSFEEDV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,73),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
