*********************************************************************
* MFS for MFSFEEDV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV00M  MSG   TYPE=INPUT,SOR=(MFSFEEDV00I,IGNORE),
               NXT=MFSFEEDV00O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=30,
               JUST=L
         MSGEND
*
MFSFEEDV00O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV00D,IGNORE),
               NXT=MFSFEEDV00M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=30
         MSGEND
*
MFSFEEDV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,61),ATTR=(PROT,NUM)
         FMTEND
         END
