*********************************************************************
* MFS for MFSFEEDV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV14M  MSG   TYPE=INPUT,SOR=(MFSFEEDV14I,IGNORE),
               NXT=MFSFEEDV14O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=R
         MSGEND
*
MFSFEEDV14O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV14D,IGNORE),
               NXT=MFSFEEDV14M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=20
         MSGEND
*
MFSFEEDV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,37),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,47),ATTR=(PROT,NUM)
         FMTEND
         END
