*********************************************************************
* MFS for MFSFEEDV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV01M  MSG   TYPE=INPUT,SOR=(MFSFEEDV01I,IGNORE),
               NXT=MFSFEEDV01O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=R
         MSGEND
*
MFSFEEDV01O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV01D,IGNORE),
               NXT=MFSFEEDV01M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=16
         MSGEND
*
MFSFEEDV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,9),ATTR=(PROT,NUM)
         FMTEND
         END
