*********************************************************************
* MFS for MFSFEEDV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV08M  MSG   TYPE=INPUT,SOR=(MFSFEEDV08I,IGNORE),
               NXT=MFSFEEDV08O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=L
         MFLD  'FLD008',LTH=10,
               JUST=L
         MFLD  'FLD009',LTH=16,
               JUST=L
         MFLD  'FLD010',LTH=8,
               JUST=L
         MFLD  'FLD011',LTH=12,
               JUST=R
         MFLD  'FLD012',LTH=30,
               JUST=L
         MSGEND
*
MFSFEEDV08O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV08D,IGNORE),
               NXT=MFSFEEDV08M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=16
         MFLD  'FLD010',LTH=8
         MFLD  'FLD011',LTH=12
         MFLD  'FLD012',LTH=30
         MSGEND
*
MFSFEEDV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(3,19),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=16,
               POS=(3,31),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=12,
               POS=(3,59),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=30,
               POS=(3,73),ATTR=(PROT,NUM)
         FMTEND
         END
