*********************************************************************
* MFS for MFSFEEDV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV12M  MSG   TYPE=INPUT,SOR=(MFSFEEDV12I,IGNORE),
               NXT=MFSFEEDV12O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=L
         MSGEND
*
MFSFEEDV12O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV12D,IGNORE),
               NXT=MFSFEEDV12M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSFEEDV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,37),ATTR=(PROT,NUM)
         FMTEND
         END
