*********************************************************************
* MFS for MFSFEEDV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV09M  MSG   TYPE=INPUT,SOR=(MFSFEEDV09I,IGNORE),
               NXT=MFSFEEDV09O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=10,
               JUST=R
         MFLD  'FLD011',LTH=10,
               JUST=R
         MFLD  'FLD012',LTH=16,
               JUST=R
         MFLD  'FLD013',LTH=16,
               JUST=L
         MSGEND
*
MFSFEEDV09O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV09D,IGNORE),
               NXT=MFSFEEDV09M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=8
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=10
         MFLD  'FLD012',LTH=16
         MFLD  'FLD013',LTH=16
         MSGEND
*
MFSFEEDV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(2,51),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(3,35),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=16,
               POS=(3,47),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=16,
               POS=(3,65),ATTR=(PROT,NUM)
         FMTEND
         END
