*********************************************************************
* MFS for MFSFEEDV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV11M  MSG   TYPE=INPUT,SOR=(MFSFEEDV11I,IGNORE),
               NXT=MFSFEEDV11O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MSGEND
*
MFSFEEDV11O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV11D,IGNORE),
               NXT=MFSFEEDV11M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=40
         MSGEND
*
MFSFEEDV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,61),ATTR=(PROT,NUM)
         FMTEND
         END
