*********************************************************************
* MFS for MFSFEEDV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV04M  MSG   TYPE=INPUT,SOR=(MFSFEEDV04I,IGNORE),
               NXT=MFSFEEDV04O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MSGEND
*
MFSFEEDV04O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV04D,IGNORE),
               NXT=MFSFEEDV04M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=20
         MSGEND
*
MFSFEEDV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
