*********************************************************************
* MFS for MFSFEEDV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV02M  MSG   TYPE=INPUT,SOR=(MFSFEEDV02I,IGNORE),
               NXT=MFSFEEDV02O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=R
         MSGEND
*
MFSFEEDV02O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV02D,IGNORE),
               NXT=MFSFEEDV02M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=40
         MSGEND
*
MFSFEEDV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,51),ATTR=(PROT,NUM)
         FMTEND
         END
