*********************************************************************
* MFS for MFSFEEDV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV04M  MSG   TYPE=INPUT,SOR=(MFSFEEDV04I,IGNORE),
               NXT=MFSFEEDV04O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=R
         MSGEND
*
MFSFEEDV04O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV04D,IGNORE),
               NXT=MFSFEEDV04M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=20
         MSGEND
*
MFSFEEDV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(3,29),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,71),ATTR=(PROT,NUM)
         FMTEND
         END
