*********************************************************************
* MFS for MFSFEEDV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV06M  MSG   TYPE=INPUT,SOR=(MFSFEEDV06I,IGNORE),
               NXT=MFSFEEDV06O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=L
         MFLD  'FLD010',LTH=8,
               JUST=R
         MSGEND
*
MFSFEEDV06O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV06D,IGNORE),
               NXT=MFSFEEDV06M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=8
         MSGEND
*
MFSFEEDV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,59),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(4,11),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(4,43),ATTR=(PROT,NUM)
         FMTEND
         END
