*********************************************************************
* MFS for MFSFEEDV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV05M  MSG   TYPE=INPUT,SOR=(MFSFEEDV05I,IGNORE),
               NXT=MFSFEEDV05O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=R
         MFLD  'FLD008',LTH=12,
               JUST=R
         MFLD  'FLD009',LTH=20,
               JUST=R
         MSGEND
*
MFSFEEDV05O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV05D,IGNORE),
               NXT=MFSFEEDV05M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=20
         MSGEND
*
MFSFEEDV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,51),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(3,69),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=20,
               POS=(4,3),ATTR=(PROT,NUM)
         FMTEND
         END
