*********************************************************************
* MFS for MFSFEEDV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV13M  MSG   TYPE=INPUT,SOR=(MFSFEEDV13I,IGNORE),
               NXT=MFSFEEDV13O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=L
         MSGEND
*
MFSFEEDV13O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV13D,IGNORE),
               NXT=MFSFEEDV13M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=8
         MSGEND
*
MFSFEEDV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,51),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,69),ATTR=(PROT,NUM)
         FMTEND
         END
