*********************************************************************
* MFS for MFSFEEDV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV10M  MSG   TYPE=INPUT,SOR=(MFSFEEDV10I,IGNORE),
               NXT=MFSFEEDV10O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=R
         MSGEND
*
MFSFEEDV10O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV10D,IGNORE),
               NXT=MFSFEEDV10M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=40
         MSGEND
*
MFSFEEDV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,15),ATTR=(PROT,NUM)
         FMTEND
         END
