*********************************************************************
* MFS for MFSFEEDV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV10M  MSG   TYPE=INPUT,SOR=(MFSFEEDV10I,IGNORE),
               NXT=MFSFEEDV10O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MSGEND
*
MFSFEEDV10O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV10D,IGNORE),
               NXT=MFSFEEDV10M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=20
         MSGEND
*
MFSFEEDV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,77),ATTR=(PROT,NUM)
         FMTEND
         END
