*********************************************************************
* MFS for MFSFEEDV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSFEEDV03M  MSG   TYPE=INPUT,SOR=(MFSFEEDV03I,IGNORE),
               NXT=MFSFEEDV03O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MSGEND
*
MFSFEEDV03O  MSG   TYPE=OUTPUT,SOR=(MFSFEEDV03D,IGNORE),
               NXT=MFSFEEDV03M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=16
         MSGEND
*
MFSFEEDV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,55),ATTR=(PROT,NUM)
         FMTEND
         END
