*********************************************************************
* MFS for MFSGLDBV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV02M  MSG   TYPE=INPUT,SOR=(MFSGLDBV02I,IGNORE),
               NXT=MFSGLDBV02O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=L
         MSGEND
*
MFSGLDBV02O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV02D,IGNORE),
               NXT=MFSGLDBV02M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=8
         MSGEND
*
MFSGLDBV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,29),ATTR=(PROT,NUM)
         FMTEND
         END
