*********************************************************************
* MFS for MFSGLDBV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV05M  MSG   TYPE=INPUT,SOR=(MFSGLDBV05I,IGNORE),
               NXT=MFSGLDBV05O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=R
         MSGEND
*
MFSGLDBV05O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV05D,IGNORE),
               NXT=MFSGLDBV05M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=30
         MSGEND
*
MFSGLDBV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,3),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,21),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,43),ATTR=(PROT,NUM)
         FMTEND
         END
