*********************************************************************
* MFS for MFSGLDBV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV04M  MSG   TYPE=INPUT,SOR=(MFSGLDBV04I,IGNORE),
               NXT=MFSGLDBV04O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=L
         MSGEND
*
MFSGLDBV04O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV04D,IGNORE),
               NXT=MFSGLDBV04M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSGLDBV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,9),ATTR=(PROT,NUM)
         FMTEND
         END
