*********************************************************************
* MFS for MFSGLDBV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV03M  MSG   TYPE=INPUT,SOR=(MFSGLDBV03I,IGNORE),
               NXT=MFSGLDBV03O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=L
         MSGEND
*
MFSGLDBV03O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV03D,IGNORE),
               NXT=MFSGLDBV03M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=12
         MSGEND
*
MFSGLDBV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,11),ATTR=(PROT,NUM)
         FMTEND
         END
