*********************************************************************
* MFS for MFSGLDBV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV14M  MSG   TYPE=INPUT,SOR=(MFSGLDBV14I,IGNORE),
               NXT=MFSGLDBV14O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=40,
               JUST=L
         MFLD  'FLD008',LTH=16,
               JUST=L
         MSGEND
*
MFSGLDBV14O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV14D,IGNORE),
               NXT=MFSGLDBV14M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=16
         MSGEND
*
MFSGLDBV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(2,67),ATTR=(PROT,NUM)
         FMTEND
         END
