*********************************************************************
* MFS for MFSGLDBV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV12M  MSG   TYPE=INPUT,SOR=(MFSGLDBV12I,IGNORE),
               NXT=MFSGLDBV12O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MSGEND
*
MFSGLDBV12O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV12D,IGNORE),
               NXT=MFSGLDBV12M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=8
         MSGEND
*
MFSGLDBV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,29),ATTR=(PROT,NUM)
         FMTEND
         END
