*********************************************************************
* MFS for MFSGLDBV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSGLDBV01M  MSG   TYPE=INPUT,SOR=(MFSGLDBV01I,IGNORE),
               NXT=MFSGLDBV01O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MSGEND
*
MFSGLDBV01O  MSG   TYPE=OUTPUT,SOR=(MFSGLDBV01D,IGNORE),
               NXT=MFSGLDBV01M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=16
         MSGEND
*
MFSGLDBV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,43),ATTR=(PROT,NUM)
         FMTEND
         END
