*********************************************************************
* MFS for MFSHOLDV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV01M  MSG   TYPE=INPUT,SOR=(MFSHOLDV01I,IGNORE),
               NXT=MFSHOLDV01O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=R
         MSGEND
*
MFSHOLDV01O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV01D,IGNORE),
               NXT=MFSHOLDV01M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=20
         MSGEND
*
MFSHOLDV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(1,77),ATTR=(PROT,NUM)
         FMTEND
         END
