*********************************************************************
* MFS for MFSHOLDV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV12M  MSG   TYPE=INPUT,SOR=(MFSHOLDV12I,IGNORE),
               NXT=MFSHOLDV12O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=10,
               JUST=L
         MSGEND
*
MFSHOLDV12O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV12D,IGNORE),
               NXT=MFSHOLDV12M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=10
         MSGEND
*
MFSHOLDV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,3),ATTR=(PROT,NUM)
         FMTEND
         END
