*********************************************************************
* MFS for MFSHOLDV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV14M  MSG   TYPE=INPUT,SOR=(MFSHOLDV14I,IGNORE),
               NXT=MFSHOLDV14O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=20,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MSGEND
*
MFSHOLDV14O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV14D,IGNORE),
               NXT=MFSHOLDV14M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=20
         MSGEND
*
MFSHOLDV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,23),ATTR=(PROT,NUM)
         FMTEND
         END
