*********************************************************************
* MFS for MFSHOLDV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV09M  MSG   TYPE=INPUT,SOR=(MFSHOLDV09I,IGNORE),
               NXT=MFSHOLDV09O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=R
         MFLD  'FLD010',LTH=12,
               JUST=R
         MFLD  'FLD011',LTH=8,
               JUST=L
         MFLD  'FLD012',LTH=40,
               JUST=L
         MFLD  'FLD013',LTH=20,
               JUST=R
         MSGEND
*
MFSHOLDV09O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV09D,IGNORE),
               NXT=MFSHOLDV09M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=8
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=8
         MFLD  'FLD012',LTH=40
         MFLD  'FLD013',LTH=20
         MSGEND
*
MFSHOLDV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,39),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,27),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,41),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=8,
               POS=(3,55),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=40,
               POS=(3,65),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=20,
               POS=(4,27),ATTR=(PROT,NUM)
         FMTEND
         END
