*********************************************************************
* MFS for MFSHOLDV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV03M  MSG   TYPE=INPUT,SOR=(MFSHOLDV03I,IGNORE),
               NXT=MFSHOLDV03O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=16,
               JUST=R
         MFLD  'FLD007',LTH=40,
               JUST=L
         MSGEND
*
MFSHOLDV03O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV03D,IGNORE),
               NXT=MFSHOLDV03M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSHOLDV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,77),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(3,15),ATTR=(PROT,NUM)
         FMTEND
         END
