*********************************************************************
* MFS for MFSHOLDV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV05M  MSG   TYPE=INPUT,SOR=(MFSHOLDV05I,IGNORE),
               NXT=MFSHOLDV05O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=L
         MSGEND
*
MFSHOLDV05O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV05D,IGNORE),
               NXT=MFSHOLDV05M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=12
         MSGEND
*
MFSHOLDV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,37),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,69),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(4,31),ATTR=(PROT,NUM)
         FMTEND
         END
