*********************************************************************
* MFS for MFSHOLDV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV00M  MSG   TYPE=INPUT,SOR=(MFSHOLDV00I,IGNORE),
               NXT=MFSHOLDV00O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MSGEND
*
MFSHOLDV00O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV00D,IGNORE),
               NXT=MFSHOLDV00M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=16
         MSGEND
*
MFSHOLDV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,77),ATTR=(PROT,NUM)
         FMTEND
         END
