*********************************************************************
* MFS for MFSHOLDV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV09M  MSG   TYPE=INPUT,SOR=(MFSHOLDV09I,IGNORE),
               NXT=MFSHOLDV09O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=R
         MFLD  'FLD009',LTH=20,
               JUST=R
         MFLD  'FLD010',LTH=16,
               JUST=R
         MFLD  'FLD011',LTH=8,
               JUST=R
         MFLD  'FLD012',LTH=40,
               JUST=R
         MFLD  'FLD013',LTH=40,
               JUST=R
         MSGEND
*
MFSHOLDV09O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV09D,IGNORE),
               NXT=MFSHOLDV09M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=8
         MFLD  'FLD009',LTH=20
         MFLD  'FLD010',LTH=16
         MFLD  'FLD011',LTH=8
         MFLD  'FLD012',LTH=40
         MFLD  'FLD013',LTH=40
         MSGEND
*
MFSHOLDV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,25),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=20,
               POS=(3,35),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(3,57),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=8,
               POS=(3,75),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=40,
               POS=(4,5),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=40,
               POS=(4,47),ATTR=(PROT,NUM)
         FMTEND
         END
