*********************************************************************
* MFS for MFSHOLDV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV02M  MSG   TYPE=INPUT,SOR=(MFSHOLDV02I,IGNORE),
               NXT=MFSHOLDV02O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MSGEND
*
MFSHOLDV02O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV02D,IGNORE),
               NXT=MFSHOLDV02M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=30
         MSGEND
*
MFSHOLDV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(3,1),ATTR=(PROT,NUM)
         FMTEND
         END
