*********************************************************************
* MFS for MFSHOLDV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV11M  MSG   TYPE=INPUT,SOR=(MFSHOLDV11I,IGNORE),
               NXT=MFSHOLDV11O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=L
         MSGEND
*
MFSHOLDV11O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV11D,IGNORE),
               NXT=MFSHOLDV11M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=30
         MSGEND
*
MFSHOLDV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,11),ATTR=(PROT,NUM)
         FMTEND
         END
