*********************************************************************
* MFS for MFSHOLDV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV04M  MSG   TYPE=INPUT,SOR=(MFSHOLDV04I,IGNORE),
               NXT=MFSHOLDV04O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=12,
               JUST=R
         MSGEND
*
MFSHOLDV04O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV04D,IGNORE),
               NXT=MFSHOLDV04M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=12
         MSGEND
*
MFSHOLDV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(2,65),ATTR=(PROT,NUM)
         FMTEND
         END
