*********************************************************************
* MFS for MFSHOLDV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSHOLDV07M  MSG   TYPE=INPUT,SOR=(MFSHOLDV07I,IGNORE),
               NXT=MFSHOLDV07O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=R
         MFLD  'FLD008',LTH=16,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MFLD  'FLD010',LTH=12,
               JUST=R
         MFLD  'FLD011',LTH=10,
               JUST=L
         MSGEND
*
MFSHOLDV07O  MSG   TYPE=OUTPUT,SOR=(MFSHOLDV07D,IGNORE),
               NXT=MFSHOLDV07M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=16
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=10
         MSGEND
*
MFSHOLDV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,71),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,5),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,35),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,47),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(3,61),ATTR=(PROT,NUM)
         FMTEND
         END
