*********************************************************************
* MFS for MFSLOANV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV02M  MSG   TYPE=INPUT,SOR=(MFSLOANV02I,IGNORE),
               NXT=MFSLOANV02O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MSGEND
*
MFSLOANV02O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV02D,IGNORE),
               NXT=MFSLOANV02M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=12
         MSGEND
*
MFSLOANV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,35),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,63),ATTR=(PROT,NUM)
         FMTEND
         END
