*********************************************************************
* MFS for MFSLOANV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV11M  MSG   TYPE=INPUT,SOR=(MFSLOANV11I,IGNORE),
               NXT=MFSLOANV11O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=12,
               JUST=L
         MSGEND
*
MFSLOANV11O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV11D,IGNORE),
               NXT=MFSLOANV11M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=12
         MSGEND
*
MFSLOANV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,13),ATTR=(PROT,NUM)
         FMTEND
         END
