*********************************************************************
* MFS for MFSLOANV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV08M  MSG   TYPE=INPUT,SOR=(MFSLOANV08I,IGNORE),
               NXT=MFSLOANV08O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=8,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=L
         MFLD  'FLD010',LTH=12,
               JUST=R
         MFLD  'FLD011',LTH=12,
               JUST=R
         MFLD  'FLD012',LTH=10,
               JUST=L
         MSGEND
*
MFSLOANV08O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV08D,IGNORE),
               NXT=MFSLOANV08M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=8
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=12
         MFLD  'FLD012',LTH=10
         MSGEND
*
MFSLOANV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,63),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=12,
               POS=(3,77),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=10,
               POS=(4,11),ATTR=(PROT,NUM)
         FMTEND
         END
