*********************************************************************
* MFS for MFSLOANV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV07M  MSG   TYPE=INPUT,SOR=(MFSLOANV07I,IGNORE),
               NXT=MFSLOANV07O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=40,
               JUST=R
         MFLD  'FLD011',LTH=12,
               JUST=R
         MSGEND
*
MFSLOANV07O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV07D,IGNORE),
               NXT=MFSLOANV07M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=12
         MSGEND
*
MFSLOANV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,29),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(4,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=12,
               POS=(4,65),ATTR=(PROT,NUM)
         FMTEND
         END
