*********************************************************************
* MFS for MFSLOANV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV01M  MSG   TYPE=INPUT,SOR=(MFSLOANV01I,IGNORE),
               NXT=MFSLOANV01O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MSGEND
*
MFSLOANV01O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV01D,IGNORE),
               NXT=MFSLOANV01M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=16
         MSGEND
*
MFSLOANV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,65),ATTR=(PROT,NUM)
         FMTEND
         END
