*********************************************************************
* MFS for MFSLOANV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV00M  MSG   TYPE=INPUT,SOR=(MFSLOANV00I,IGNORE),
               NXT=MFSLOANV00O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MSGEND
*
MFSLOANV00O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV00D,IGNORE),
               NXT=MFSLOANV00M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=16
         MSGEND
*
MFSLOANV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,23),ATTR=(PROT,NUM)
         FMTEND
         END
