*********************************************************************
* MFS for MFSLOANV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV09M  MSG   TYPE=INPUT,SOR=(MFSLOANV09I,IGNORE),
               NXT=MFSLOANV09O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=10,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=16,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=L
         MFLD  'FLD010',LTH=40,
               JUST=R
         MFLD  'FLD011',LTH=12,
               JUST=L
         MFLD  'FLD012',LTH=8,
               JUST=R
         MFLD  'FLD013',LTH=12,
               JUST=R
         MSGEND
*
MFSLOANV09O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV09D,IGNORE),
               NXT=MFSLOANV09M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=16
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=12
         MFLD  'FLD012',LTH=8
         MFLD  'FLD013',LTH=12
         MSGEND
*
MFSLOANV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(2,71),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(3,41),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=12,
               POS=(4,3),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=8,
               POS=(4,17),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=12,
               POS=(4,27),ATTR=(PROT,NUM)
         FMTEND
         END
