*********************************************************************
* MFS for MFSLOANV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV03M  MSG   TYPE=INPUT,SOR=(MFSLOANV03I,IGNORE),
               NXT=MFSLOANV03O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=L
         MSGEND
*
MFSLOANV03O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV03D,IGNORE),
               NXT=MFSLOANV03M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSLOANV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,73),ATTR=(PROT,NUM)
         FMTEND
         END
