*********************************************************************
* MFS for MFSLOANV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSLOANV12M  MSG   TYPE=INPUT,SOR=(MFSLOANV12I,IGNORE),
               NXT=MFSLOANV12O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MSGEND
*
MFSLOANV12O  MSG   TYPE=OUTPUT,SOR=(MFSLOANV12D,IGNORE),
               NXT=MFSLOANV12M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSLOANV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,49),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,71),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
