*********************************************************************
* MFS for MFSPRODV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV11M  MSG   TYPE=INPUT,SOR=(MFSPRODV11I,IGNORE),
               NXT=MFSPRODV11O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MSGEND
*
MFSPRODV11O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV11D,IGNORE),
               NXT=MFSPRODV11M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=20
         MSGEND
*
MFSPRODV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,43),ATTR=(PROT,NUM)
         FMTEND
         END
