*********************************************************************
* MFS for MFSPRODV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV02M  MSG   TYPE=INPUT,SOR=(MFSPRODV02I,IGNORE),
               NXT=MFSPRODV02O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MSGEND
*
MFSPRODV02O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV02D,IGNORE),
               NXT=MFSPRODV02M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=8
         MSGEND
*
MFSPRODV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,55),ATTR=(PROT,NUM)
         FMTEND
         END
