*********************************************************************
* MFS for MFSPRODV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV14M  MSG   TYPE=INPUT,SOR=(MFSPRODV14I,IGNORE),
               NXT=MFSPRODV14O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=8,
               JUST=R
         MSGEND
*
MFSPRODV14O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV14D,IGNORE),
               NXT=MFSPRODV14M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=8
         MSGEND
*
MFSPRODV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=8,
               POS=(2,67),ATTR=(PROT,NUM)
         FMTEND
         END
