*********************************************************************
* MFS for MFSPRODV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV04M  MSG   TYPE=INPUT,SOR=(MFSPRODV04I,IGNORE),
               NXT=MFSPRODV04O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=L
         MSGEND
*
MFSPRODV04O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV04D,IGNORE),
               NXT=MFSPRODV04M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=30
         MSGEND
*
MFSPRODV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,9),ATTR=(PROT,NUM)
         FMTEND
         END
