*********************************************************************
* MFS for MFSPRODV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV10M  MSG   TYPE=INPUT,SOR=(MFSPRODV10I,IGNORE),
               NXT=MFSPRODV10O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=R
         MSGEND
*
MFSPRODV10O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV10D,IGNORE),
               NXT=MFSPRODV10M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=12
         MSGEND
*
MFSPRODV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,9),ATTR=(PROT,NUM)
         FMTEND
         END
