*********************************************************************
* MFS for MFSPRODV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV12M  MSG   TYPE=INPUT,SOR=(MFSPRODV12I,IGNORE),
               NXT=MFSPRODV12O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MSGEND
*
MFSPRODV12O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV12D,IGNORE),
               NXT=MFSPRODV12M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSPRODV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,49),ATTR=(PROT,NUM)
         FMTEND
         END
