*********************************************************************
* MFS for MFSPRODV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV08M  MSG   TYPE=INPUT,SOR=(MFSPRODV08I,IGNORE),
               NXT=MFSPRODV08O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=20,
               JUST=L
         MFLD  'FLD008',LTH=10,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=R
         MFLD  'FLD010',LTH=30,
               JUST=L
         MFLD  'FLD011',LTH=20,
               JUST=R
         MFLD  'FLD012',LTH=16,
               JUST=L
         MSGEND
*
MFSPRODV08O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV08D,IGNORE),
               NXT=MFSPRODV08M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=30
         MFLD  'FLD011',LTH=20
         MFLD  'FLD012',LTH=16
         MSGEND
*
MFSPRODV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(3,27),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(3,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=30,
               POS=(4,13),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=20,
               POS=(4,45),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=16,
               POS=(4,67),ATTR=(PROT,NUM)
         FMTEND
         END
