*********************************************************************
* MFS for MFSPRODV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV06M  MSG   TYPE=INPUT,SOR=(MFSPRODV06I,IGNORE),
               NXT=MFSPRODV06O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=R
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=12,
               JUST=L
         MSGEND
*
MFSPRODV06O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV06D,IGNORE),
               NXT=MFSPRODV06M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=12
         MSGEND
*
MFSPRODV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,57),ATTR=(PROT,NUM)
         FMTEND
         END
