*********************************************************************
* MFS for MFSPRODV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV03M  MSG   TYPE=INPUT,SOR=(MFSPRODV03I,IGNORE),
               NXT=MFSPRODV03O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=L
         MSGEND
*
MFSPRODV03O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV03D,IGNORE),
               NXT=MFSPRODV03M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=12
         MSGEND
*
MFSPRODV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,59),ATTR=(PROT,NUM)
         FMTEND
         END
