*********************************************************************
* MFS for MFSPRODV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV13M  MSG   TYPE=INPUT,SOR=(MFSPRODV13I,IGNORE),
               NXT=MFSPRODV13O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=R
         MSGEND
*
MFSPRODV13O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV13D,IGNORE),
               NXT=MFSPRODV13M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=12
         MSGEND
*
MFSPRODV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,77),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,71),ATTR=(PROT,NUM)
         FMTEND
         END
