*********************************************************************
* MFS for MFSPRODV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV07M  MSG   TYPE=INPUT,SOR=(MFSPRODV07I,IGNORE),
               NXT=MFSPRODV07O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=20,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=16,
               JUST=L
         MFLD  'FLD009',LTH=20,
               JUST=R
         MFLD  'FLD010',LTH=16,
               JUST=L
         MFLD  'FLD011',LTH=8,
               JUST=L
         MSGEND
*
MFSPRODV07O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV07D,IGNORE),
               NXT=MFSPRODV07M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=16
         MFLD  'FLD009',LTH=20
         MFLD  'FLD010',LTH=16
         MFLD  'FLD011',LTH=8
         MSGEND
*
MFSPRODV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=16,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=20,
               POS=(3,17),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=8,
               POS=(3,57),ATTR=(PROT,NUM)
         FMTEND
         END
