*********************************************************************
* MFS for MFSPRODV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSPRODV01M  MSG   TYPE=INPUT,SOR=(MFSPRODV01I,IGNORE),
               NXT=MFSPRODV01O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MSGEND
*
MFSPRODV01O  MSG   TYPE=OUTPUT,SOR=(MFSPRODV01D,IGNORE),
               NXT=MFSPRODV01M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=40
         MSGEND
*
MFSPRODV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,7),ATTR=(PROT,NUM)
         FMTEND
         END
