*********************************************************************
* MFS for MFSRATEV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV00M  MSG   TYPE=INPUT,SOR=(MFSRATEV00I,IGNORE),
               NXT=MFSRATEV00O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=R
         MSGEND
*
MFSRATEV00O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV00D,IGNORE),
               NXT=MFSRATEV00M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=20
         MSGEND
*
MFSRATEV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,79),ATTR=(PROT,NUM)
         FMTEND
         END
