*********************************************************************
* MFS for MFSRATEV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV09M  MSG   TYPE=INPUT,SOR=(MFSRATEV09I,IGNORE),
               NXT=MFSRATEV09O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=R
         MFLD  'FLD009',LTH=20,
               JUST=L
         MFLD  'FLD010',LTH=16,
               JUST=L
         MFLD  'FLD011',LTH=16,
               JUST=R
         MFLD  'FLD012',LTH=16,
               JUST=L
         MFLD  'FLD013',LTH=20,
               JUST=L
         MSGEND
*
MFSRATEV09O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV09D,IGNORE),
               NXT=MFSRATEV09M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=20
         MFLD  'FLD010',LTH=16
         MFLD  'FLD011',LTH=16
         MFLD  'FLD012',LTH=16
         MFLD  'FLD013',LTH=20
         MSGEND
*
MFSRATEV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,13),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=20,
               POS=(3,55),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(3,77),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(4,15),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=16,
               POS=(4,33),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=20,
               POS=(4,51),ATTR=(PROT,NUM)
         FMTEND
         END
