*********************************************************************
* MFS for MFSRATEV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV13M  MSG   TYPE=INPUT,SOR=(MFSRATEV13I,IGNORE),
               NXT=MFSRATEV13O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=16,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=40,
               JUST=R
         MSGEND
*
MFSRATEV13O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV13D,IGNORE),
               NXT=MFSRATEV13M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSRATEV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
