*********************************************************************
* MFS for MFSRATEV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV05M  MSG   TYPE=INPUT,SOR=(MFSRATEV05I,IGNORE),
               NXT=MFSRATEV05O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MSGEND
*
MFSRATEV05O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV05D,IGNORE),
               NXT=MFSRATEV05M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=10
         MSGEND
*
MFSRATEV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,77),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,37),ATTR=(PROT,NUM)
         FMTEND
         END
