*********************************************************************
* MFS for MFSRATEV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV07M  MSG   TYPE=INPUT,SOR=(MFSRATEV07I,IGNORE),
               NXT=MFSRATEV07O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=R
         MFLD  'FLD009',LTH=30,
               JUST=L
         MFLD  'FLD010',LTH=40,
               JUST=R
         MFLD  'FLD011',LTH=30,
               JUST=L
         MSGEND
*
MFSRATEV07O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV07D,IGNORE),
               NXT=MFSRATEV07M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=16
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=40
         MFLD  'FLD011',LTH=30
         MSGEND
*
MFSRATEV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,35),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(3,19),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(3,61),ATTR=(PROT,NUM)
         FMTEND
         END
