*********************************************************************
* MFS for MFSRATEV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV11M  MSG   TYPE=INPUT,SOR=(MFSRATEV11I,IGNORE),
               NXT=MFSRATEV11O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=16,
               JUST=R
         MSGEND
*
MFSRATEV11O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV11D,IGNORE),
               NXT=MFSRATEV11M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=16
         MSGEND
*
MFSRATEV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=16,
               POS=(2,47),ATTR=(PROT,NUM)
         FMTEND
         END
