*********************************************************************
* MFS for MFSRATEV02
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV02M  MSG   TYPE=INPUT,SOR=(MFSRATEV02I,IGNORE),
               NXT=MFSRATEV02O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=L
         MSGEND
*
MFSRATEV02O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV02D,IGNORE),
               NXT=MFSRATEV02M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=20
         MSGEND
*
MFSRATEV02I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,51),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,63),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(3,25),ATTR=(PROT,NUM)
         FMTEND
         END
