*********************************************************************
* MFS for MFSRATEV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV11M  MSG   TYPE=INPUT,SOR=(MFSRATEV11I,IGNORE),
               NXT=MFSRATEV11O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=L
         MSGEND
*
MFSRATEV11O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV11D,IGNORE),
               NXT=MFSRATEV11M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=10
         MSGEND
*
MFSRATEV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,49),ATTR=(PROT,NUM)
         FMTEND
         END
