*********************************************************************
* MFS for MFSRATEV14
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV14M  MSG   TYPE=INPUT,SOR=(MFSRATEV14I,IGNORE),
               NXT=MFSRATEV14O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=10,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=R
         MSGEND
*
MFSRATEV14O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV14D,IGNORE),
               NXT=MFSRATEV14M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=20
         MSGEND
*
MFSRATEV14I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(2,41),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(2,53),ATTR=(PROT,NUM)
         FMTEND
         END
