*********************************************************************
* MFS for MFSRATEV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV08M  MSG   TYPE=INPUT,SOR=(MFSRATEV08I,IGNORE),
               NXT=MFSRATEV08O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=8,
               JUST=L
         MFLD  'FLD008',LTH=12,
               JUST=L
         MFLD  'FLD009',LTH=30,
               JUST=L
         MFLD  'FLD010',LTH=10,
               JUST=L
         MFLD  'FLD011',LTH=30,
               JUST=R
         MFLD  'FLD012',LTH=12,
               JUST=R
         MSGEND
*
MFSRATEV08O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV08D,IGNORE),
               NXT=MFSRATEV08M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=12
         MFLD  'FLD009',LTH=30
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=30
         MFLD  'FLD012',LTH=12
         MSGEND
*
MFSRATEV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=12,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=30,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,21),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(3,33),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=12,
               POS=(3,65),ATTR=(PROT,NUM)
         FMTEND
         END
