*********************************************************************
* MFS for MFSRATEV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV12M  MSG   TYPE=INPUT,SOR=(MFSRATEV12I,IGNORE),
               NXT=MFSRATEV12O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=10,
               JUST=L
         MSGEND
*
MFSRATEV12O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV12D,IGNORE),
               NXT=MFSRATEV12M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=10
         MSGEND
*
MFSRATEV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,13),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(2,59),ATTR=(PROT,NUM)
         FMTEND
         END
