*********************************************************************
* MFS for MFSRATEV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV06M  MSG   TYPE=INPUT,SOR=(MFSRATEV06I,IGNORE),
               NXT=MFSRATEV06O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=10,
               JUST=L
         MSGEND
*
MFSRATEV06O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV06D,IGNORE),
               NXT=MFSRATEV06M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=10
         MSGEND
*
MFSRATEV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,47),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,59),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,77),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,33),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,75),ATTR=(PROT,NUM)
         FMTEND
         END
