*********************************************************************
* MFS for MFSRATEV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV01M  MSG   TYPE=INPUT,SOR=(MFSRATEV01I,IGNORE),
               NXT=MFSRATEV01O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MSGEND
*
MFSRATEV01O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV01D,IGNORE),
               NXT=MFSRATEV01M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=30
         MSGEND
*
MFSRATEV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(2,13),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,55),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,65),ATTR=(PROT,NUM)
         FMTEND
         END
