*********************************************************************
* MFS for MFSRATEV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSRATEV04M  MSG   TYPE=INPUT,SOR=(MFSRATEV04I,IGNORE),
               NXT=MFSRATEV04O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=8,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=L
         MSGEND
*
MFSRATEV04O  MSG   TYPE=OUTPUT,SOR=(MFSRATEV04D,IGNORE),
               NXT=MFSRATEV04M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=40
         MSGEND
*
MFSRATEV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(2,3),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,11),ATTR=(PROT,NUM)
         FMTEND
         END
