*********************************************************************
* MFS for MFSSTOPV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV13M  MSG   TYPE=INPUT,SOR=(MFSSTOPV13I,IGNORE),
               NXT=MFSSTOPV13O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=10,
               JUST=R
         MSGEND
*
MFSSTOPV13O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV13D,IGNORE),
               NXT=MFSSTOPV13M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=10
         MSGEND
*
MFSSTOPV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,59),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,73),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,3),ATTR=(PROT,NUM)
         FMTEND
         END
