*********************************************************************
* MFS for MFSSTOPV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV09M  MSG   TYPE=INPUT,SOR=(MFSSTOPV09I,IGNORE),
               NXT=MFSSTOPV09O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=40,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=8,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=R
         MFLD  'FLD009',LTH=12,
               JUST=L
         MFLD  'FLD010',LTH=16,
               JUST=L
         MFLD  'FLD011',LTH=16,
               JUST=R
         MFLD  'FLD012',LTH=10,
               JUST=R
         MFLD  'FLD013',LTH=8,
               JUST=R
         MSGEND
*
MFSSTOPV09O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV09D,IGNORE),
               NXT=MFSSTOPV09M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=40
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=8
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=16
         MFLD  'FLD011',LTH=16
         MFLD  'FLD012',LTH=10
         MFLD  'FLD013',LTH=8
         MSGEND
*
MFSSTOPV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=40,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,31),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=8,
               POS=(3,29),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,39),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(4,1),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=16,
               POS=(4,15),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(4,33),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=10,
               POS=(4,51),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=8,
               POS=(4,63),ATTR=(PROT,NUM)
         FMTEND
         END
