*********************************************************************
* MFS for MFSSTOPV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV03M  MSG   TYPE=INPUT,SOR=(MFSSTOPV03I,IGNORE),
               NXT=MFSSTOPV03O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=R
         MSGEND
*
MFSSTOPV03O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV03D,IGNORE),
               NXT=MFSSTOPV03M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=30
         MSGEND
*
MFSSTOPV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,71),ATTR=(PROT,NUM)
         FMTEND
         END
