*********************************************************************
* MFS for MFSSTOPV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV05M  MSG   TYPE=INPUT,SOR=(MFSSTOPV05I,IGNORE),
               NXT=MFSSTOPV05O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=R
         MSGEND
*
MFSSTOPV05O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV05D,IGNORE),
               NXT=MFSSTOPV05M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=12
         MSGEND
*
MFSSTOPV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,21),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,35),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,23),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,1),ATTR=(PROT,NUM)
         FMTEND
         END
