*********************************************************************
* MFS for MFSSTOPV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV00M  MSG   TYPE=INPUT,SOR=(MFSSTOPV00I,IGNORE),
               NXT=MFSSTOPV00O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MSGEND
*
MFSSTOPV00O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV00D,IGNORE),
               NXT=MFSSTOPV00M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MSGEND
*
MFSSTOPV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,39),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,51),ATTR=(PROT,NUM)
         FMTEND
         END
