*********************************************************************
* MFS for MFSSTOPV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV09M  MSG   TYPE=INPUT,SOR=(MFSSTOPV09I,IGNORE),
               NXT=MFSSTOPV09O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=10,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=L
         MFLD  'FLD010',LTH=12,
               JUST=R
         MFLD  'FLD011',LTH=12,
               JUST=R
         MFLD  'FLD012',LTH=8,
               JUST=R
         MFLD  'FLD013',LTH=30,
               JUST=R
         MSGEND
*
MFSSTOPV09O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV09D,IGNORE),
               NXT=MFSSTOPV09M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=10
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=12
         MFLD  'FLD011',LTH=12
         MFLD  'FLD012',LTH=8
         MFLD  'FLD013',LTH=30
         MSGEND
*
MFSSTOPV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,71),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=10,
               POS=(3,3),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,15),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,29),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(4,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=12,
               POS=(4,37),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=8,
               POS=(4,51),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=30,
               POS=(4,61),ATTR=(PROT,NUM)
         FMTEND
         END
