*********************************************************************
* MFS for MFSSTOPV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV13M  MSG   TYPE=INPUT,SOR=(MFSSTOPV13I,IGNORE),
               NXT=MFSSTOPV13O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=L
         MSGEND
*
MFSSTOPV13O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV13D,IGNORE),
               NXT=MFSSTOPV13M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=20
         MSGEND
*
MFSSTOPV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,69),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(1,79),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,29),ATTR=(PROT,NUM)
         FMTEND
         END
