*********************************************************************
* MFS for MFSSTOPV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV01M  MSG   TYPE=INPUT,SOR=(MFSSTOPV01I,IGNORE),
               NXT=MFSSTOPV01O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=R
         MSGEND
*
MFSSTOPV01O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV01D,IGNORE),
               NXT=MFSSTOPV01M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MSGEND
*
MFSSTOPV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,27),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(1,71),ATTR=(PROT,NUM)
         FMTEND
         END
