*********************************************************************
* MFS for MFSSTOPV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV12M  MSG   TYPE=INPUT,SOR=(MFSSTOPV12I,IGNORE),
               NXT=MFSSTOPV12O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MSGEND
*
MFSSTOPV12O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV12D,IGNORE),
               NXT=MFSSTOPV12M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=30
         MSGEND
*
MFSSTOPV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,17),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,29),ATTR=(PROT,NUM)
         FMTEND
         END
