*********************************************************************
* MFS for MFSSTOPV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV03M  MSG   TYPE=INPUT,SOR=(MFSSTOPV03I,IGNORE),
               NXT=MFSSTOPV03O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=R
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=L
         MSGEND
*
MFSSTOPV03O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV03D,IGNORE),
               NXT=MFSSTOPV03M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=30
         MSGEND
*
MFSSTOPV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,35),ATTR=(PROT,NUM)
         FMTEND
         END
