*********************************************************************
* MFS for MFSSTOPV12
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV12M  MSG   TYPE=INPUT,SOR=(MFSSTOPV12I,IGNORE),
               NXT=MFSSTOPV12O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=L
         MSGEND
*
MFSSTOPV12O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV12D,IGNORE),
               NXT=MFSSTOPV12M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=30
         MSGEND
*
MFSSTOPV12I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,41),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,67),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,61),ATTR=(PROT,NUM)
         FMTEND
         END
