*********************************************************************
* MFS for MFSSTOPV10
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV10M  MSG   TYPE=INPUT,SOR=(MFSSTOPV10I,IGNORE),
               NXT=MFSSTOPV10O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=12,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=R
         MSGEND
*
MFSSTOPV10O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV10D,IGNORE),
               NXT=MFSSTOPV10M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=8
         MSGEND
*
MFSSTOPV10I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,21),ATTR=(PROT,NUM)
         FMTEND
         END
