*********************************************************************
* MFS for MFSSTOPV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV06M  MSG   TYPE=INPUT,SOR=(MFSSTOPV06I,IGNORE),
               NXT=MFSSTOPV06O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=R
         MFLD  'FLD007',LTH=16,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MFLD  'FLD010',LTH=12,
               JUST=R
         MSGEND
*
MFSSTOPV06O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV06D,IGNORE),
               NXT=MFSSTOPV06M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=12
         MSGEND
*
MFSSTOPV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,29),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,75),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,27),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=12,
               POS=(3,39),ATTR=(PROT,NUM)
         FMTEND
         END
