*********************************************************************
* MFS for MFSSTOPV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV06M  MSG   TYPE=INPUT,SOR=(MFSSTOPV06I,IGNORE),
               NXT=MFSSTOPV06O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=40,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=L
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=10,
               JUST=R
         MFLD  'FLD008',LTH=40,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=L
         MFLD  'FLD010',LTH=10,
               JUST=L
         MSGEND
*
MFSSTOPV06O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV06D,IGNORE),
               NXT=MFSSTOPV06M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=10
         MSGEND
*
MFSSTOPV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,59),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,25),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,37),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,79),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(4,11),ATTR=(PROT,NUM)
         FMTEND
         END
