*********************************************************************
* MFS for MFSSTOPV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV07M  MSG   TYPE=INPUT,SOR=(MFSSTOPV07I,IGNORE),
               NXT=MFSSTOPV07O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=R
         MFLD  'FLD009',LTH=16,
               JUST=L
         MFLD  'FLD010',LTH=30,
               JUST=L
         MFLD  'FLD011',LTH=16,
               JUST=L
         MSGEND
*
MFSSTOPV07O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV07D,IGNORE),
               NXT=MFSSTOPV07M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=16
         MFLD  'FLD010',LTH=30
         MFLD  'FLD011',LTH=16
         MSGEND
*
MFSSTOPV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,53),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=16,
               POS=(3,31),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=30,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(4,1),ATTR=(PROT,NUM)
         FMTEND
         END
