*********************************************************************
* MFS for MFSSTOPV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSSTOPV08M  MSG   TYPE=INPUT,SOR=(MFSSTOPV08I,IGNORE),
               NXT=MFSSTOPV08O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=30,
               JUST=R
         MFLD  'FLD002',LTH=8,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=20,
               JUST=L
         MFLD  'FLD008',LTH=40,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=L
         MFLD  'FLD010',LTH=10,
               JUST=L
         MFLD  'FLD011',LTH=20,
               JUST=L
         MFLD  'FLD012',LTH=30,
               JUST=R
         MSGEND
*
MFSSTOPV08O  MSG   TYPE=OUTPUT,SOR=(MFSSTOPV08D,IGNORE),
               NXT=MFSSTOPV08M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=8
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=20
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=20
         MFLD  'FLD012',LTH=30
         MSGEND
*
MFSSTOPV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=8,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,77),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=20,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,11),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,53),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(3,67),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=20,
               POS=(3,79),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=30,
               POS=(4,21),ATTR=(PROT,NUM)
         FMTEND
         END
