*********************************************************************
* MFS for MFSTXNDV05
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV05M  MSG   TYPE=INPUT,SOR=(MFSTXNDV05I,IGNORE),
               NXT=MFSTXNDV05O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=40,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=R
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=20,
               JUST=R
         MFLD  'FLD009',LTH=16,
               JUST=R
         MSGEND
*
MFSTXNDV05O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV05D,IGNORE),
               NXT=MFSTXNDV05M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=16
         MSGEND
*
MFSTXNDV05I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,21),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,39),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,9),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=16,
               POS=(3,31),ATTR=(PROT,NUM)
         FMTEND
         END
