*********************************************************************
* MFS for MFSTXNDV13
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV13M  MSG   TYPE=INPUT,SOR=(MFSTXNDV13I,IGNORE),
               NXT=MFSTXNDV13O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=10,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=10,
               JUST=R
         MFLD  'FLD006',LTH=30,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=R
         MSGEND
*
MFSTXNDV13O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV13D,IGNORE),
               NXT=MFSTXNDV13M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=10
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=30
         MFLD  'FLD007',LTH=30
         MSGEND
*
MFSTXNDV13I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=10,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=30,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,53),ATTR=(PROT,NUM)
         FMTEND
         END
