*********************************************************************
* MFS for MFSTXNDV07
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV07M  MSG   TYPE=INPUT,SOR=(MFSTXNDV07I,IGNORE),
               NXT=MFSTXNDV07O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=20,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=R
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=30,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=16,
               JUST=L
         MFLD  'FLD010',LTH=8,
               JUST=R
         MFLD  'FLD011',LTH=10,
               JUST=R
         MSGEND
*
MFSTXNDV07O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV07D,IGNORE),
               NXT=MFSTXNDV07M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=20
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=16
         MFLD  'FLD010',LTH=8
         MFLD  'FLD011',LTH=10
         MSGEND
*
MFSTXNDV07I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=20,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,59),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(2,1),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=16,
               POS=(3,45),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(3,63),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=10,
               POS=(3,73),ATTR=(PROT,NUM)
         FMTEND
         END
