*********************************************************************
* MFS for MFSTXNDV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV03M  MSG   TYPE=INPUT,SOR=(MFSTXNDV03I,IGNORE),
               NXT=MFSTXNDV03O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=10,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=L
         MSGEND
*
MFSTXNDV03O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV03D,IGNORE),
               NXT=MFSTXNDV03M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=10
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=12
         MSGEND
*
MFSTXNDV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,71),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=10,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(3,7),ATTR=(PROT,NUM)
         FMTEND
         END
