*********************************************************************
* MFS for MFSTXNDV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV00M  MSG   TYPE=INPUT,SOR=(MFSTXNDV00I,IGNORE),
               NXT=MFSTXNDV00O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=L
         MFLD  'FLD001',LTH=40,
               JUST=R
         MFLD  'FLD002',LTH=10,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MSGEND
*
MFSTXNDV00O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV00D,IGNORE),
               NXT=MFSTXNDV00M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=40
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=12
         MSGEND
*
MFSTXNDV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=40,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,7),ATTR=(PROT,NUM)
         FMTEND
         END
