*********************************************************************
* MFS for MFSTXNDV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV09M  MSG   TYPE=INPUT,SOR=(MFSTXNDV09I,IGNORE),
               NXT=MFSTXNDV09O
         SEG
         MFLD  'FLD000',LTH=8,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=L
         MFLD  'FLD004',LTH=30,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=R
         MFLD  'FLD007',LTH=30,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=R
         MFLD  'FLD009',LTH=8,
               JUST=L
         MFLD  'FLD010',LTH=20,
               JUST=R
         MFLD  'FLD011',LTH=16,
               JUST=R
         MFLD  'FLD012',LTH=16,
               JUST=R
         MFLD  'FLD013',LTH=10,
               JUST=L
         MSGEND
*
MFSTXNDV09O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV09D,IGNORE),
               NXT=MFSTXNDV09M
         SEG
         MFLD  'FLD000',LTH=8
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=12
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=30
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=8
         MFLD  'FLD010',LTH=20
         MFLD  'FLD011',LTH=16
         MFLD  'FLD012',LTH=16
         MFLD  'FLD013',LTH=10
         MSGEND
*
MFSTXNDV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=8,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,11),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,39),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,53),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(2,5),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=30,
               POS=(2,29),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(2,61),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=8,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=20,
               POS=(3,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=16,
               POS=(3,45),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=16,
               POS=(3,63),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=10,
               POS=(4,1),ATTR=(PROT,NUM)
         FMTEND
         END
