*********************************************************************
* MFS for MFSTXNDV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV06M  MSG   TYPE=INPUT,SOR=(MFSTXNDV06I,IGNORE),
               NXT=MFSTXNDV06O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=40,
               JUST=L
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=R
         MFLD  'FLD005',LTH=20,
               JUST=R
         MFLD  'FLD006',LTH=12,
               JUST=L
         MFLD  'FLD007',LTH=16,
               JUST=R
         MFLD  'FLD008',LTH=10,
               JUST=R
         MFLD  'FLD009',LTH=10,
               JUST=R
         MFLD  'FLD010',LTH=40,
               JUST=R
         MSGEND
*
MFSTXNDV06O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV06D,IGNORE),
               NXT=MFSTXNDV06M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=40
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=12
         MFLD  'FLD007',LTH=16
         MFLD  'FLD008',LTH=10
         MFLD  'FLD009',LTH=10
         MFLD  'FLD010',LTH=40
         MSGEND
*
MFSTXNDV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=40,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(2,19),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,33),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,45),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=12,
               POS=(2,67),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=16,
               POS=(3,1),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=10,
               POS=(3,19),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=10,
               POS=(3,31),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=40,
               POS=(3,43),ATTR=(PROT,NUM)
         FMTEND
         END
