*********************************************************************
* MFS for MFSTXNDV04
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV04M  MSG   TYPE=INPUT,SOR=(MFSTXNDV04I,IGNORE),
               NXT=MFSTXNDV04O
         SEG
         MFLD  'FLD000',LTH=20,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=16,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=8,
               JUST=R
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=40,
               JUST=L
         MFLD  'FLD007',LTH=12,
               JUST=R
         MFLD  'FLD008',LTH=30,
               JUST=R
         MSGEND
*
MFSTXNDV04O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV04D,IGNORE),
               NXT=MFSTXNDV04M
         SEG
         MFLD  'FLD000',LTH=20
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=8
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=40
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=30
         MSGEND
*
MFSTXNDV04I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=20,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,23),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=8,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(1,75),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=40,
               POS=(2,37),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,13),ATTR=(PROT,NUM)
         FMTEND
         END
