*********************************************************************
* MFS for MFSTXNDV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSTXNDV01M  MSG   TYPE=INPUT,SOR=(MFSTXNDV01I,IGNORE),
               NXT=MFSTXNDV01O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=R
         MFLD  'FLD003',LTH=12,
               JUST=L
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=30,
               JUST=L
         MSGEND
*
MFSTXNDV01O  MSG   TYPE=OUTPUT,SOR=(MFSTXNDV01D,IGNORE),
               NXT=MFSTXNDV01M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=30
         MSGEND
*
MFSTXNDV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,47),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,61),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(1,79),ATTR=(PROT,NUM)
         FMTEND
         END
