*********************************************************************
* MFS for MFSWIREV03
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV03M  MSG   TYPE=INPUT,SOR=(MFSWIREV03I,IGNORE),
               NXT=MFSWIREV03O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=L
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=12,
               JUST=L
         MFLD  'FLD003',LTH=8,
               JUST=L
         MFLD  'FLD004',LTH=40,
               JUST=R
         MFLD  'FLD005',LTH=8,
               JUST=L
         MFLD  'FLD006',LTH=8,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=R
         MSGEND
*
MFSWIREV03O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV03D,IGNORE),
               NXT=MFSWIREV03M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=12
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=40
         MFLD  'FLD005',LTH=8
         MFLD  'FLD006',LTH=8
         MFLD  'FLD007',LTH=40
         MSGEND
*
MFSWIREV03I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=12,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,39),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,49),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,11),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=8,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(2,31),ATTR=(PROT,NUM)
         FMTEND
         END
