*********************************************************************
* MFS for MFSWIREV09
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV09M  MSG   TYPE=INPUT,SOR=(MFSWIREV09I,IGNORE),
               NXT=MFSWIREV09O
         SEG
         MFLD  'FLD000',LTH=40,
               JUST=L
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=10,
               JUST=R
         MFLD  'FLD004',LTH=20,
               JUST=L
         MFLD  'FLD005',LTH=20,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=L
         MFLD  'FLD007',LTH=10,
               JUST=R
         MFLD  'FLD008',LTH=40,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=L
         MFLD  'FLD010',LTH=8,
               JUST=L
         MFLD  'FLD011',LTH=30,
               JUST=R
         MFLD  'FLD012',LTH=30,
               JUST=L
         MFLD  'FLD013',LTH=40,
               JUST=R
         MSGEND
*
MFSWIREV09O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV09D,IGNORE),
               NXT=MFSWIREV09M
         SEG
         MFLD  'FLD000',LTH=40
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=10
         MFLD  'FLD004',LTH=20
         MFLD  'FLD005',LTH=20
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=10
         MFLD  'FLD008',LTH=40
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=8
         MFLD  'FLD011',LTH=30
         MFLD  'FLD012',LTH=30
         MFLD  'FLD013',LTH=40
         MSGEND
*
MFSWIREV09I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=40,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,57),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=10,
               POS=(2,9),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=20,
               POS=(2,21),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=20,
               POS=(2,43),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,65),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=10,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=40,
               POS=(3,19),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,61),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=8,
               POS=(4,23),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(4,33),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=30,
               POS=(4,65),ATTR=(PROT,NUM)
         DFLD  'FLD013',LTH=40,
               POS=(5,17),ATTR=(PROT,NUM)
         FMTEND
         END
