*********************************************************************
* MFS for MFSWIREV08
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV08M  MSG   TYPE=INPUT,SOR=(MFSWIREV08I,IGNORE),
               NXT=MFSWIREV08O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=R
         MFLD  'FLD001',LTH=30,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=30,
               JUST=R
         MFLD  'FLD004',LTH=10,
               JUST=L
         MFLD  'FLD005',LTH=40,
               JUST=L
         MFLD  'FLD006',LTH=16,
               JUST=L
         MFLD  'FLD007',LTH=40,
               JUST=L
         MFLD  'FLD008',LTH=20,
               JUST=L
         MFLD  'FLD009',LTH=12,
               JUST=L
         MFLD  'FLD010',LTH=10,
               JUST=R
         MFLD  'FLD011',LTH=30,
               JUST=L
         MFLD  'FLD012',LTH=12,
               JUST=R
         MSGEND
*
MFSWIREV08O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV08D,IGNORE),
               NXT=MFSWIREV08M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=30
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=30
         MFLD  'FLD004',LTH=10
         MFLD  'FLD005',LTH=40
         MFLD  'FLD006',LTH=16
         MFLD  'FLD007',LTH=40
         MFLD  'FLD008',LTH=20
         MFLD  'FLD009',LTH=12
         MFLD  'FLD010',LTH=10
         MFLD  'FLD011',LTH=30
         MFLD  'FLD012',LTH=12
         MSGEND
*
MFSWIREV08I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=30,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,45),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=30,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=10,
               POS=(2,15),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=40,
               POS=(2,27),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=16,
               POS=(2,69),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=40,
               POS=(3,7),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=20,
               POS=(3,49),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=12,
               POS=(3,71),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=10,
               POS=(4,5),ATTR=(PROT,NUM)
         DFLD  'FLD011',LTH=30,
               POS=(4,17),ATTR=(PROT,NUM)
         DFLD  'FLD012',LTH=12,
               POS=(4,49),ATTR=(PROT,NUM)
         FMTEND
         END
