*********************************************************************
* MFS for MFSWIREV06
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV06M  MSG   TYPE=INPUT,SOR=(MFSWIREV06I,IGNORE),
               NXT=MFSWIREV06O
         SEG
         MFLD  'FLD000',LTH=10,
               JUST=L
         MFLD  'FLD001',LTH=16,
               JUST=L
         MFLD  'FLD002',LTH=30,
               JUST=R
         MFLD  'FLD003',LTH=8,
               JUST=R
         MFLD  'FLD004',LTH=30,
               JUST=R
         MFLD  'FLD005',LTH=30,
               JUST=L
         MFLD  'FLD006',LTH=20,
               JUST=R
         MFLD  'FLD007',LTH=12,
               JUST=L
         MFLD  'FLD008',LTH=30,
               JUST=L
         MFLD  'FLD009',LTH=40,
               JUST=R
         MFLD  'FLD010',LTH=20,
               JUST=L
         MSGEND
*
MFSWIREV06O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV06D,IGNORE),
               NXT=MFSWIREV06M
         SEG
         MFLD  'FLD000',LTH=10
         MFLD  'FLD001',LTH=16
         MFLD  'FLD002',LTH=30
         MFLD  'FLD003',LTH=8
         MFLD  'FLD004',LTH=30
         MFLD  'FLD005',LTH=30
         MFLD  'FLD006',LTH=20
         MFLD  'FLD007',LTH=12
         MFLD  'FLD008',LTH=30
         MFLD  'FLD009',LTH=40
         MFLD  'FLD010',LTH=20
         MSGEND
*
MFSWIREV06I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=10,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=16,
               POS=(1,13),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=30,
               POS=(1,31),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=8,
               POS=(1,63),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=30,
               POS=(1,73),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=30,
               POS=(2,25),ATTR=(PROT,NUM)
         DFLD  'FLD006',LTH=20,
               POS=(2,57),ATTR=(PROT,NUM)
         DFLD  'FLD007',LTH=12,
               POS=(2,79),ATTR=(PROT,NUM)
         DFLD  'FLD008',LTH=30,
               POS=(3,13),ATTR=(PROT,NUM)
         DFLD  'FLD009',LTH=40,
               POS=(3,45),ATTR=(PROT,NUM)
         DFLD  'FLD010',LTH=20,
               POS=(4,7),ATTR=(PROT,NUM)
         FMTEND
         END
