*********************************************************************
* MFS for MFSWIREV11
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV11M  MSG   TYPE=INPUT,SOR=(MFSWIREV11I,IGNORE),
               NXT=MFSWIREV11O
         SEG
         MFLD  'FLD000',LTH=12,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=L
         MFLD  'FLD002',LTH=10,
               JUST=R
         MFLD  'FLD003',LTH=16,
               JUST=R
         MFLD  'FLD004',LTH=16,
               JUST=L
         MFLD  'FLD005',LTH=12,
               JUST=L
         MSGEND
*
MFSWIREV11O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV11D,IGNORE),
               NXT=MFSWIREV11M
         SEG
         MFLD  'FLD000',LTH=12
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=10
         MFLD  'FLD003',LTH=16
         MFLD  'FLD004',LTH=16
         MFLD  'FLD005',LTH=12
         MSGEND
*
MFSWIREV11I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=12,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,15),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=10,
               POS=(1,25),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=16,
               POS=(1,37),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=16,
               POS=(1,55),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=12,
               POS=(1,73),ATTR=(PROT,NUM)
         FMTEND
         END
