*********************************************************************
* MFS for MFSWIREV00
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV00M  MSG   TYPE=INPUT,SOR=(MFSWIREV00I,IGNORE),
               NXT=MFSWIREV00O
         SEG
         MFLD  'FLD000',LTH=16,
               JUST=R
         MFLD  'FLD001',LTH=12,
               JUST=L
         MFLD  'FLD002',LTH=16,
               JUST=R
         MFLD  'FLD003',LTH=12,
               JUST=R
         MFLD  'FLD004',LTH=40,
               JUST=L
         MSGEND
*
MFSWIREV00O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV00D,IGNORE),
               NXT=MFSWIREV00M
         SEG
         MFLD  'FLD000',LTH=16
         MFLD  'FLD001',LTH=12
         MFLD  'FLD002',LTH=16
         MFLD  'FLD003',LTH=12
         MFLD  'FLD004',LTH=40
         MSGEND
*
MFSWIREV00I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=16,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=12,
               POS=(1,19),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=16,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=12,
               POS=(1,51),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=40,
               POS=(1,65),ATTR=(PROT,NUM)
         FMTEND
         END
