*********************************************************************
* MFS for MFSWIREV01
* Pacific National Bank — IMS/TM Message Format
*********************************************************************
         PRINT NOGEN
MFSWIREV01M  MSG   TYPE=INPUT,SOR=(MFSWIREV01I,IGNORE),
               NXT=MFSWIREV01O
         SEG
         MFLD  'FLD000',LTH=30,
               JUST=R
         MFLD  'FLD001',LTH=8,
               JUST=R
         MFLD  'FLD002',LTH=20,
               JUST=L
         MFLD  'FLD003',LTH=20,
               JUST=R
         MFLD  'FLD004',LTH=12,
               JUST=L
         MFLD  'FLD005',LTH=8,
               JUST=R
         MSGEND
*
MFSWIREV01O  MSG   TYPE=OUTPUT,SOR=(MFSWIREV01D,IGNORE),
               NXT=MFSWIREV01M
         SEG
         MFLD  'FLD000',LTH=30
         MFLD  'FLD001',LTH=8
         MFLD  'FLD002',LTH=20
         MFLD  'FLD003',LTH=20
         MFLD  'FLD004',LTH=12
         MFLD  'FLD005',LTH=8
         MSGEND
*
MFSWIREV01I  FMT
         DEV   TYPE=(3270,2),FEAT=(IGNORE),DSCA=X'0020'
         DIV   TYPE=INOUT
         DFLD  'FLD000',LTH=30,
               POS=(1,1),ATTR=(PROT,NUM)
         DFLD  'FLD001',LTH=8,
               POS=(1,33),ATTR=(PROT,NUM)
         DFLD  'FLD002',LTH=20,
               POS=(1,43),ATTR=(PROT,NUM)
         DFLD  'FLD003',LTH=20,
               POS=(1,65),ATTR=(PROT,NUM)
         DFLD  'FLD004',LTH=12,
               POS=(2,7),ATTR=(PROT,NUM)
         DFLD  'FLD005',LTH=8,
               POS=(2,21),ATTR=(PROT,NUM)
         FMTEND
         END
