 DBD NAME=ACCTDB,ACCESS=HIDAM,RMODE=F
 DATASET DD1=ACB.ACCT.DB
 SEGM NAME=ACCTROOT,BYTES=256,FREQ=OPT
 FIELD NAME=ACCTNUM,BYTES=16,START=1,TYPE=C
 FIELD NAME=CUSTID,BYTES=12,START=17,TYPE=C
 FIELD NAME=ACCTTYPE,BYTES=2,START=29,TYPE=C
 SEGM NAME=ACCTBAL,BYTES=64,PARENT=((ACCTROOT,DBLE)),FREQ=OPT
 FIELD NAME=CURRBAL,BYTES=8,START=1,TYPE=P
 FIELD NAME=AVAILBAL,BYTES=8,START=9,TYPE=P
 DBDGEN
