*********************************************************************
* PSB for PSBALERV01
* Pacific National Bank — IMS/DB Program Specification
*********************************************************************
         PCB   TYPE=DB,DBDNAME=ACCTDBV00,
               PROCOPT=GI,
               KEYLEN=16,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=CUSTDBV01,
               PROCOPT=GR,
               KEYLEN=20,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=ACCTDBV02,
               PROCOPT=GR,
               KEYLEN=24,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
*
         PSBGEN LANG=COBOL,PSBNAME=PSBALERV01,
               IOASIZE=4096
         END
