*********************************************************************
* PSB for PSBBRCHV08
* Pacific National Bank — IMS/DB Program Specification
*********************************************************************
         PCB   TYPE=DB,DBDNAME=ACCTDBV00,
               PROCOPT=GR,
               KEYLEN=16,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         SENSEG NAME=SEG004,
               PARENT=SEG003,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=CUSTDBV01,
               PROCOPT=GI,
               KEYLEN=20,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         SENSEG NAME=SEG004,
               PARENT=SEG003,
               PROCOPT=A
*
         PSBGEN LANG=COBOL,PSBNAME=PSBBRCHV08,
               IOASIZE=4096
         END
