*********************************************************************
* PSB for PSBSTOPV07
* Pacific National Bank — IMS/DB Program Specification
*********************************************************************
         PCB   TYPE=DB,DBDNAME=ACCTDBV00,
               PROCOPT=GI,
               KEYLEN=16,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=CUSTDBV01,
               PROCOPT=R,
               KEYLEN=20,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=ACCTDBV02,
               PROCOPT=I,
               KEYLEN=24,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=CUSTDBV03,
               PROCOPT=I,
               KEYLEN=28,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=ACCTDBV04,
               PROCOPT=G,
               KEYLEN=32,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         SENSEG NAME=SEG002,
               PARENT=SEG001,
               PROCOPT=A
         SENSEG NAME=SEG003,
               PARENT=SEG002,
               PROCOPT=A
*
         PSBGEN LANG=COBOL,PSBNAME=PSBSTOPV07,
               IOASIZE=4096
         END
