*********************************************************************
* PSB for PSBTXNDV05
* Pacific National Bank — IMS/DB Program Specification
*********************************************************************
         PCB   TYPE=DB,DBDNAME=ACCTDBV00,
               PROCOPT=I,
               KEYLEN=16,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=CUSTDBV01,
               PROCOPT=I,
               KEYLEN=20,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
         PCB   TYPE=DB,DBDNAME=ACCTDBV02,
               PROCOPT=R,
               KEYLEN=24,
               POS=SINGLE
         SENSEG NAME=SEG000,
               PARENT=0,
               PROCOPT=A
         SENSEG NAME=SEG001,
               PARENT=SEG000,
               PROCOPT=A
*
         PSBGEN LANG=COBOL,PSBNAME=PSBTXNDV05,
               IOASIZE=4096
         END
