/*********************************************************************/
/* PNB Include 0013 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_013_000 FIXED DEC(15,2);
  DCL shared_str_013_000 CHAR(40);
  DCL shared_field_013_001 FIXED DEC(15,2);
  DCL shared_str_013_001 CHAR(40);
  DCL shared_field_013_002 FIXED DEC(15,2);
  DCL shared_str_013_002 CHAR(40);
  DCL shared_field_013_003 FIXED DEC(15,2);
  DCL shared_str_013_003 CHAR(40);
  DCL shared_field_013_004 FIXED DEC(15,2);
  DCL shared_str_013_004 CHAR(40);
  DCL shared_field_013_005 FIXED DEC(15,2);
  DCL shared_str_013_005 CHAR(40);
  DCL shared_field_013_006 FIXED DEC(15,2);
  DCL shared_str_013_006 CHAR(40);
  DCL shared_field_013_007 FIXED DEC(15,2);
  DCL shared_str_013_007 CHAR(40);
  DCL shared_field_013_008 FIXED DEC(15,2);
  DCL shared_str_013_008 CHAR(40);
  DCL shared_field_013_009 FIXED DEC(15,2);
  DCL shared_str_013_009 CHAR(40);
  DCL shared_field_013_010 FIXED DEC(15,2);
  DCL shared_str_013_010 CHAR(40);
  DCL shared_field_013_011 FIXED DEC(15,2);
  DCL shared_str_013_011 CHAR(40);
  DCL shared_field_013_012 FIXED DEC(15,2);
  DCL shared_str_013_012 CHAR(40);
  DCL shared_field_013_013 FIXED DEC(15,2);
  DCL shared_str_013_013 CHAR(40);
  DCL shared_field_013_014 FIXED DEC(15,2);
  DCL shared_str_013_014 CHAR(40);
  DCL shared_field_013_015 FIXED DEC(15,2);
  DCL shared_str_013_015 CHAR(40);
  DCL shared_field_013_016 FIXED DEC(15,2);
  DCL shared_str_013_016 CHAR(40);
  DCL shared_field_013_017 FIXED DEC(15,2);
  DCL shared_str_013_017 CHAR(40);
  DCL shared_field_013_018 FIXED DEC(15,2);
  DCL shared_str_013_018 CHAR(40);
  DCL shared_field_013_019 FIXED DEC(15,2);
  DCL shared_str_013_019 CHAR(40);
  DCL shared_field_013_020 FIXED DEC(15,2);
  DCL shared_str_013_020 CHAR(40);
  DCL shared_field_013_021 FIXED DEC(15,2);
  DCL shared_str_013_021 CHAR(40);
  DCL shared_field_013_022 FIXED DEC(15,2);
  DCL shared_str_013_022 CHAR(40);
  DCL shared_field_013_023 FIXED DEC(15,2);
  DCL shared_str_013_023 CHAR(40);
  DCL shared_field_013_024 FIXED DEC(15,2);
  DCL shared_str_013_024 CHAR(40);
  DCL shared_field_013_025 FIXED DEC(15,2);
  DCL shared_str_013_025 CHAR(40);
  DCL shared_field_013_026 FIXED DEC(15,2);
  DCL shared_str_013_026 CHAR(40);
  DCL shared_field_013_027 FIXED DEC(15,2);
  DCL shared_str_013_027 CHAR(40);
  DCL shared_field_013_028 FIXED DEC(15,2);
  DCL shared_str_013_028 CHAR(40);
  DCL shared_field_013_029 FIXED DEC(15,2);
  DCL shared_str_013_029 CHAR(40);
