/*********************************************************************/
/* PNB Include 0031 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_031_000 FIXED DEC(15,2);
  DCL shared_str_031_000 CHAR(40);
  DCL shared_field_031_001 FIXED DEC(15,2);
  DCL shared_str_031_001 CHAR(40);
  DCL shared_field_031_002 FIXED DEC(15,2);
  DCL shared_str_031_002 CHAR(40);
  DCL shared_field_031_003 FIXED DEC(15,2);
  DCL shared_str_031_003 CHAR(40);
  DCL shared_field_031_004 FIXED DEC(15,2);
  DCL shared_str_031_004 CHAR(40);
  DCL shared_field_031_005 FIXED DEC(15,2);
  DCL shared_str_031_005 CHAR(40);
  DCL shared_field_031_006 FIXED DEC(15,2);
  DCL shared_str_031_006 CHAR(40);
  DCL shared_field_031_007 FIXED DEC(15,2);
  DCL shared_str_031_007 CHAR(40);
  DCL shared_field_031_008 FIXED DEC(15,2);
  DCL shared_str_031_008 CHAR(40);
  DCL shared_field_031_009 FIXED DEC(15,2);
  DCL shared_str_031_009 CHAR(40);
  DCL shared_field_031_010 FIXED DEC(15,2);
  DCL shared_str_031_010 CHAR(40);
  DCL shared_field_031_011 FIXED DEC(15,2);
  DCL shared_str_031_011 CHAR(40);
  DCL shared_field_031_012 FIXED DEC(15,2);
  DCL shared_str_031_012 CHAR(40);
  DCL shared_field_031_013 FIXED DEC(15,2);
  DCL shared_str_031_013 CHAR(40);
  DCL shared_field_031_014 FIXED DEC(15,2);
  DCL shared_str_031_014 CHAR(40);
  DCL shared_field_031_015 FIXED DEC(15,2);
  DCL shared_str_031_015 CHAR(40);
  DCL shared_field_031_016 FIXED DEC(15,2);
  DCL shared_str_031_016 CHAR(40);
  DCL shared_field_031_017 FIXED DEC(15,2);
  DCL shared_str_031_017 CHAR(40);
  DCL shared_field_031_018 FIXED DEC(15,2);
  DCL shared_str_031_018 CHAR(40);
  DCL shared_field_031_019 FIXED DEC(15,2);
  DCL shared_str_031_019 CHAR(40);
  DCL shared_field_031_020 FIXED DEC(15,2);
  DCL shared_str_031_020 CHAR(40);
  DCL shared_field_031_021 FIXED DEC(15,2);
  DCL shared_str_031_021 CHAR(40);
  DCL shared_field_031_022 FIXED DEC(15,2);
  DCL shared_str_031_022 CHAR(40);
  DCL shared_field_031_023 FIXED DEC(15,2);
  DCL shared_str_031_023 CHAR(40);
  DCL shared_field_031_024 FIXED DEC(15,2);
  DCL shared_str_031_024 CHAR(40);
  DCL shared_field_031_025 FIXED DEC(15,2);
  DCL shared_str_031_025 CHAR(40);
  DCL shared_field_031_026 FIXED DEC(15,2);
  DCL shared_str_031_026 CHAR(40);
  DCL shared_field_031_027 FIXED DEC(15,2);
  DCL shared_str_031_027 CHAR(40);
  DCL shared_field_031_028 FIXED DEC(15,2);
  DCL shared_str_031_028 CHAR(40);
  DCL shared_field_031_029 FIXED DEC(15,2);
  DCL shared_str_031_029 CHAR(40);
