/*********************************************************************/
/* PNB Include 0019 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_019_000 FIXED DEC(15,2);
  DCL shared_str_019_000 CHAR(40);
  DCL shared_field_019_001 FIXED DEC(15,2);
  DCL shared_str_019_001 CHAR(40);
  DCL shared_field_019_002 FIXED DEC(15,2);
  DCL shared_str_019_002 CHAR(40);
  DCL shared_field_019_003 FIXED DEC(15,2);
  DCL shared_str_019_003 CHAR(40);
  DCL shared_field_019_004 FIXED DEC(15,2);
  DCL shared_str_019_004 CHAR(40);
  DCL shared_field_019_005 FIXED DEC(15,2);
  DCL shared_str_019_005 CHAR(40);
  DCL shared_field_019_006 FIXED DEC(15,2);
  DCL shared_str_019_006 CHAR(40);
  DCL shared_field_019_007 FIXED DEC(15,2);
  DCL shared_str_019_007 CHAR(40);
  DCL shared_field_019_008 FIXED DEC(15,2);
  DCL shared_str_019_008 CHAR(40);
  DCL shared_field_019_009 FIXED DEC(15,2);
  DCL shared_str_019_009 CHAR(40);
  DCL shared_field_019_010 FIXED DEC(15,2);
  DCL shared_str_019_010 CHAR(40);
  DCL shared_field_019_011 FIXED DEC(15,2);
  DCL shared_str_019_011 CHAR(40);
  DCL shared_field_019_012 FIXED DEC(15,2);
  DCL shared_str_019_012 CHAR(40);
  DCL shared_field_019_013 FIXED DEC(15,2);
  DCL shared_str_019_013 CHAR(40);
  DCL shared_field_019_014 FIXED DEC(15,2);
  DCL shared_str_019_014 CHAR(40);
  DCL shared_field_019_015 FIXED DEC(15,2);
  DCL shared_str_019_015 CHAR(40);
  DCL shared_field_019_016 FIXED DEC(15,2);
  DCL shared_str_019_016 CHAR(40);
  DCL shared_field_019_017 FIXED DEC(15,2);
  DCL shared_str_019_017 CHAR(40);
  DCL shared_field_019_018 FIXED DEC(15,2);
  DCL shared_str_019_018 CHAR(40);
  DCL shared_field_019_019 FIXED DEC(15,2);
  DCL shared_str_019_019 CHAR(40);
  DCL shared_field_019_020 FIXED DEC(15,2);
  DCL shared_str_019_020 CHAR(40);
  DCL shared_field_019_021 FIXED DEC(15,2);
  DCL shared_str_019_021 CHAR(40);
  DCL shared_field_019_022 FIXED DEC(15,2);
  DCL shared_str_019_022 CHAR(40);
  DCL shared_field_019_023 FIXED DEC(15,2);
  DCL shared_str_019_023 CHAR(40);
  DCL shared_field_019_024 FIXED DEC(15,2);
  DCL shared_str_019_024 CHAR(40);
  DCL shared_field_019_025 FIXED DEC(15,2);
  DCL shared_str_019_025 CHAR(40);
  DCL shared_field_019_026 FIXED DEC(15,2);
  DCL shared_str_019_026 CHAR(40);
  DCL shared_field_019_027 FIXED DEC(15,2);
  DCL shared_str_019_027 CHAR(40);
  DCL shared_field_019_028 FIXED DEC(15,2);
  DCL shared_str_019_028 CHAR(40);
  DCL shared_field_019_029 FIXED DEC(15,2);
  DCL shared_str_019_029 CHAR(40);
