/*********************************************************************/
/* PNB Include 0015 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_015_000 FIXED DEC(15,2);
  DCL shared_str_015_000 CHAR(40);
  DCL shared_field_015_001 FIXED DEC(15,2);
  DCL shared_str_015_001 CHAR(40);
  DCL shared_field_015_002 FIXED DEC(15,2);
  DCL shared_str_015_002 CHAR(40);
  DCL shared_field_015_003 FIXED DEC(15,2);
  DCL shared_str_015_003 CHAR(40);
  DCL shared_field_015_004 FIXED DEC(15,2);
  DCL shared_str_015_004 CHAR(40);
  DCL shared_field_015_005 FIXED DEC(15,2);
  DCL shared_str_015_005 CHAR(40);
  DCL shared_field_015_006 FIXED DEC(15,2);
  DCL shared_str_015_006 CHAR(40);
  DCL shared_field_015_007 FIXED DEC(15,2);
  DCL shared_str_015_007 CHAR(40);
  DCL shared_field_015_008 FIXED DEC(15,2);
  DCL shared_str_015_008 CHAR(40);
  DCL shared_field_015_009 FIXED DEC(15,2);
  DCL shared_str_015_009 CHAR(40);
  DCL shared_field_015_010 FIXED DEC(15,2);
  DCL shared_str_015_010 CHAR(40);
  DCL shared_field_015_011 FIXED DEC(15,2);
  DCL shared_str_015_011 CHAR(40);
  DCL shared_field_015_012 FIXED DEC(15,2);
  DCL shared_str_015_012 CHAR(40);
  DCL shared_field_015_013 FIXED DEC(15,2);
  DCL shared_str_015_013 CHAR(40);
  DCL shared_field_015_014 FIXED DEC(15,2);
  DCL shared_str_015_014 CHAR(40);
  DCL shared_field_015_015 FIXED DEC(15,2);
  DCL shared_str_015_015 CHAR(40);
  DCL shared_field_015_016 FIXED DEC(15,2);
  DCL shared_str_015_016 CHAR(40);
  DCL shared_field_015_017 FIXED DEC(15,2);
  DCL shared_str_015_017 CHAR(40);
  DCL shared_field_015_018 FIXED DEC(15,2);
  DCL shared_str_015_018 CHAR(40);
  DCL shared_field_015_019 FIXED DEC(15,2);
  DCL shared_str_015_019 CHAR(40);
  DCL shared_field_015_020 FIXED DEC(15,2);
  DCL shared_str_015_020 CHAR(40);
  DCL shared_field_015_021 FIXED DEC(15,2);
  DCL shared_str_015_021 CHAR(40);
  DCL shared_field_015_022 FIXED DEC(15,2);
  DCL shared_str_015_022 CHAR(40);
  DCL shared_field_015_023 FIXED DEC(15,2);
  DCL shared_str_015_023 CHAR(40);
  DCL shared_field_015_024 FIXED DEC(15,2);
  DCL shared_str_015_024 CHAR(40);
  DCL shared_field_015_025 FIXED DEC(15,2);
  DCL shared_str_015_025 CHAR(40);
  DCL shared_field_015_026 FIXED DEC(15,2);
  DCL shared_str_015_026 CHAR(40);
  DCL shared_field_015_027 FIXED DEC(15,2);
  DCL shared_str_015_027 CHAR(40);
  DCL shared_field_015_028 FIXED DEC(15,2);
  DCL shared_str_015_028 CHAR(40);
  DCL shared_field_015_029 FIXED DEC(15,2);
  DCL shared_str_015_029 CHAR(40);
