/*********************************************************************/
/* PNB Include 0026 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_026_000 FIXED DEC(15,2);
  DCL shared_str_026_000 CHAR(40);
  DCL shared_field_026_001 FIXED DEC(15,2);
  DCL shared_str_026_001 CHAR(40);
  DCL shared_field_026_002 FIXED DEC(15,2);
  DCL shared_str_026_002 CHAR(40);
  DCL shared_field_026_003 FIXED DEC(15,2);
  DCL shared_str_026_003 CHAR(40);
  DCL shared_field_026_004 FIXED DEC(15,2);
  DCL shared_str_026_004 CHAR(40);
  DCL shared_field_026_005 FIXED DEC(15,2);
  DCL shared_str_026_005 CHAR(40);
  DCL shared_field_026_006 FIXED DEC(15,2);
  DCL shared_str_026_006 CHAR(40);
  DCL shared_field_026_007 FIXED DEC(15,2);
  DCL shared_str_026_007 CHAR(40);
  DCL shared_field_026_008 FIXED DEC(15,2);
  DCL shared_str_026_008 CHAR(40);
  DCL shared_field_026_009 FIXED DEC(15,2);
  DCL shared_str_026_009 CHAR(40);
  DCL shared_field_026_010 FIXED DEC(15,2);
  DCL shared_str_026_010 CHAR(40);
  DCL shared_field_026_011 FIXED DEC(15,2);
  DCL shared_str_026_011 CHAR(40);
  DCL shared_field_026_012 FIXED DEC(15,2);
  DCL shared_str_026_012 CHAR(40);
  DCL shared_field_026_013 FIXED DEC(15,2);
  DCL shared_str_026_013 CHAR(40);
  DCL shared_field_026_014 FIXED DEC(15,2);
  DCL shared_str_026_014 CHAR(40);
  DCL shared_field_026_015 FIXED DEC(15,2);
  DCL shared_str_026_015 CHAR(40);
  DCL shared_field_026_016 FIXED DEC(15,2);
  DCL shared_str_026_016 CHAR(40);
  DCL shared_field_026_017 FIXED DEC(15,2);
  DCL shared_str_026_017 CHAR(40);
  DCL shared_field_026_018 FIXED DEC(15,2);
  DCL shared_str_026_018 CHAR(40);
  DCL shared_field_026_019 FIXED DEC(15,2);
  DCL shared_str_026_019 CHAR(40);
  DCL shared_field_026_020 FIXED DEC(15,2);
  DCL shared_str_026_020 CHAR(40);
  DCL shared_field_026_021 FIXED DEC(15,2);
  DCL shared_str_026_021 CHAR(40);
  DCL shared_field_026_022 FIXED DEC(15,2);
  DCL shared_str_026_022 CHAR(40);
  DCL shared_field_026_023 FIXED DEC(15,2);
  DCL shared_str_026_023 CHAR(40);
  DCL shared_field_026_024 FIXED DEC(15,2);
  DCL shared_str_026_024 CHAR(40);
  DCL shared_field_026_025 FIXED DEC(15,2);
  DCL shared_str_026_025 CHAR(40);
  DCL shared_field_026_026 FIXED DEC(15,2);
  DCL shared_str_026_026 CHAR(40);
  DCL shared_field_026_027 FIXED DEC(15,2);
  DCL shared_str_026_027 CHAR(40);
  DCL shared_field_026_028 FIXED DEC(15,2);
  DCL shared_str_026_028 CHAR(40);
  DCL shared_field_026_029 FIXED DEC(15,2);
  DCL shared_str_026_029 CHAR(40);
