/*********************************************************************/
/* PNB Include 0014 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_014_000 FIXED DEC(15,2);
  DCL shared_str_014_000 CHAR(40);
  DCL shared_field_014_001 FIXED DEC(15,2);
  DCL shared_str_014_001 CHAR(40);
  DCL shared_field_014_002 FIXED DEC(15,2);
  DCL shared_str_014_002 CHAR(40);
  DCL shared_field_014_003 FIXED DEC(15,2);
  DCL shared_str_014_003 CHAR(40);
  DCL shared_field_014_004 FIXED DEC(15,2);
  DCL shared_str_014_004 CHAR(40);
  DCL shared_field_014_005 FIXED DEC(15,2);
  DCL shared_str_014_005 CHAR(40);
  DCL shared_field_014_006 FIXED DEC(15,2);
  DCL shared_str_014_006 CHAR(40);
  DCL shared_field_014_007 FIXED DEC(15,2);
  DCL shared_str_014_007 CHAR(40);
  DCL shared_field_014_008 FIXED DEC(15,2);
  DCL shared_str_014_008 CHAR(40);
  DCL shared_field_014_009 FIXED DEC(15,2);
  DCL shared_str_014_009 CHAR(40);
  DCL shared_field_014_010 FIXED DEC(15,2);
  DCL shared_str_014_010 CHAR(40);
  DCL shared_field_014_011 FIXED DEC(15,2);
  DCL shared_str_014_011 CHAR(40);
  DCL shared_field_014_012 FIXED DEC(15,2);
  DCL shared_str_014_012 CHAR(40);
  DCL shared_field_014_013 FIXED DEC(15,2);
  DCL shared_str_014_013 CHAR(40);
  DCL shared_field_014_014 FIXED DEC(15,2);
  DCL shared_str_014_014 CHAR(40);
  DCL shared_field_014_015 FIXED DEC(15,2);
  DCL shared_str_014_015 CHAR(40);
  DCL shared_field_014_016 FIXED DEC(15,2);
  DCL shared_str_014_016 CHAR(40);
  DCL shared_field_014_017 FIXED DEC(15,2);
  DCL shared_str_014_017 CHAR(40);
  DCL shared_field_014_018 FIXED DEC(15,2);
  DCL shared_str_014_018 CHAR(40);
  DCL shared_field_014_019 FIXED DEC(15,2);
  DCL shared_str_014_019 CHAR(40);
  DCL shared_field_014_020 FIXED DEC(15,2);
  DCL shared_str_014_020 CHAR(40);
  DCL shared_field_014_021 FIXED DEC(15,2);
  DCL shared_str_014_021 CHAR(40);
  DCL shared_field_014_022 FIXED DEC(15,2);
  DCL shared_str_014_022 CHAR(40);
  DCL shared_field_014_023 FIXED DEC(15,2);
  DCL shared_str_014_023 CHAR(40);
  DCL shared_field_014_024 FIXED DEC(15,2);
  DCL shared_str_014_024 CHAR(40);
  DCL shared_field_014_025 FIXED DEC(15,2);
  DCL shared_str_014_025 CHAR(40);
  DCL shared_field_014_026 FIXED DEC(15,2);
  DCL shared_str_014_026 CHAR(40);
  DCL shared_field_014_027 FIXED DEC(15,2);
  DCL shared_str_014_027 CHAR(40);
  DCL shared_field_014_028 FIXED DEC(15,2);
  DCL shared_str_014_028 CHAR(40);
  DCL shared_field_014_029 FIXED DEC(15,2);
  DCL shared_str_014_029 CHAR(40);
