/*********************************************************************/
/* PNB Include 0029 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_029_000 FIXED DEC(15,2);
  DCL shared_str_029_000 CHAR(40);
  DCL shared_field_029_001 FIXED DEC(15,2);
  DCL shared_str_029_001 CHAR(40);
  DCL shared_field_029_002 FIXED DEC(15,2);
  DCL shared_str_029_002 CHAR(40);
  DCL shared_field_029_003 FIXED DEC(15,2);
  DCL shared_str_029_003 CHAR(40);
  DCL shared_field_029_004 FIXED DEC(15,2);
  DCL shared_str_029_004 CHAR(40);
  DCL shared_field_029_005 FIXED DEC(15,2);
  DCL shared_str_029_005 CHAR(40);
  DCL shared_field_029_006 FIXED DEC(15,2);
  DCL shared_str_029_006 CHAR(40);
  DCL shared_field_029_007 FIXED DEC(15,2);
  DCL shared_str_029_007 CHAR(40);
  DCL shared_field_029_008 FIXED DEC(15,2);
  DCL shared_str_029_008 CHAR(40);
  DCL shared_field_029_009 FIXED DEC(15,2);
  DCL shared_str_029_009 CHAR(40);
  DCL shared_field_029_010 FIXED DEC(15,2);
  DCL shared_str_029_010 CHAR(40);
  DCL shared_field_029_011 FIXED DEC(15,2);
  DCL shared_str_029_011 CHAR(40);
  DCL shared_field_029_012 FIXED DEC(15,2);
  DCL shared_str_029_012 CHAR(40);
  DCL shared_field_029_013 FIXED DEC(15,2);
  DCL shared_str_029_013 CHAR(40);
  DCL shared_field_029_014 FIXED DEC(15,2);
  DCL shared_str_029_014 CHAR(40);
  DCL shared_field_029_015 FIXED DEC(15,2);
  DCL shared_str_029_015 CHAR(40);
  DCL shared_field_029_016 FIXED DEC(15,2);
  DCL shared_str_029_016 CHAR(40);
  DCL shared_field_029_017 FIXED DEC(15,2);
  DCL shared_str_029_017 CHAR(40);
  DCL shared_field_029_018 FIXED DEC(15,2);
  DCL shared_str_029_018 CHAR(40);
  DCL shared_field_029_019 FIXED DEC(15,2);
  DCL shared_str_029_019 CHAR(40);
  DCL shared_field_029_020 FIXED DEC(15,2);
  DCL shared_str_029_020 CHAR(40);
  DCL shared_field_029_021 FIXED DEC(15,2);
  DCL shared_str_029_021 CHAR(40);
  DCL shared_field_029_022 FIXED DEC(15,2);
  DCL shared_str_029_022 CHAR(40);
  DCL shared_field_029_023 FIXED DEC(15,2);
  DCL shared_str_029_023 CHAR(40);
  DCL shared_field_029_024 FIXED DEC(15,2);
  DCL shared_str_029_024 CHAR(40);
  DCL shared_field_029_025 FIXED DEC(15,2);
  DCL shared_str_029_025 CHAR(40);
  DCL shared_field_029_026 FIXED DEC(15,2);
  DCL shared_str_029_026 CHAR(40);
  DCL shared_field_029_027 FIXED DEC(15,2);
  DCL shared_str_029_027 CHAR(40);
  DCL shared_field_029_028 FIXED DEC(15,2);
  DCL shared_str_029_028 CHAR(40);
  DCL shared_field_029_029 FIXED DEC(15,2);
  DCL shared_str_029_029 CHAR(40);
