/*********************************************************************/
/* PNB Include 0004 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_004_000 FIXED DEC(15,2);
  DCL shared_str_004_000 CHAR(40);
  DCL shared_field_004_001 FIXED DEC(15,2);
  DCL shared_str_004_001 CHAR(40);
  DCL shared_field_004_002 FIXED DEC(15,2);
  DCL shared_str_004_002 CHAR(40);
  DCL shared_field_004_003 FIXED DEC(15,2);
  DCL shared_str_004_003 CHAR(40);
  DCL shared_field_004_004 FIXED DEC(15,2);
  DCL shared_str_004_004 CHAR(40);
  DCL shared_field_004_005 FIXED DEC(15,2);
  DCL shared_str_004_005 CHAR(40);
  DCL shared_field_004_006 FIXED DEC(15,2);
  DCL shared_str_004_006 CHAR(40);
  DCL shared_field_004_007 FIXED DEC(15,2);
  DCL shared_str_004_007 CHAR(40);
  DCL shared_field_004_008 FIXED DEC(15,2);
  DCL shared_str_004_008 CHAR(40);
  DCL shared_field_004_009 FIXED DEC(15,2);
  DCL shared_str_004_009 CHAR(40);
  DCL shared_field_004_010 FIXED DEC(15,2);
  DCL shared_str_004_010 CHAR(40);
  DCL shared_field_004_011 FIXED DEC(15,2);
  DCL shared_str_004_011 CHAR(40);
  DCL shared_field_004_012 FIXED DEC(15,2);
  DCL shared_str_004_012 CHAR(40);
  DCL shared_field_004_013 FIXED DEC(15,2);
  DCL shared_str_004_013 CHAR(40);
  DCL shared_field_004_014 FIXED DEC(15,2);
  DCL shared_str_004_014 CHAR(40);
  DCL shared_field_004_015 FIXED DEC(15,2);
  DCL shared_str_004_015 CHAR(40);
  DCL shared_field_004_016 FIXED DEC(15,2);
  DCL shared_str_004_016 CHAR(40);
  DCL shared_field_004_017 FIXED DEC(15,2);
  DCL shared_str_004_017 CHAR(40);
  DCL shared_field_004_018 FIXED DEC(15,2);
  DCL shared_str_004_018 CHAR(40);
  DCL shared_field_004_019 FIXED DEC(15,2);
  DCL shared_str_004_019 CHAR(40);
  DCL shared_field_004_020 FIXED DEC(15,2);
  DCL shared_str_004_020 CHAR(40);
  DCL shared_field_004_021 FIXED DEC(15,2);
  DCL shared_str_004_021 CHAR(40);
  DCL shared_field_004_022 FIXED DEC(15,2);
  DCL shared_str_004_022 CHAR(40);
  DCL shared_field_004_023 FIXED DEC(15,2);
  DCL shared_str_004_023 CHAR(40);
  DCL shared_field_004_024 FIXED DEC(15,2);
  DCL shared_str_004_024 CHAR(40);
  DCL shared_field_004_025 FIXED DEC(15,2);
  DCL shared_str_004_025 CHAR(40);
  DCL shared_field_004_026 FIXED DEC(15,2);
  DCL shared_str_004_026 CHAR(40);
  DCL shared_field_004_027 FIXED DEC(15,2);
  DCL shared_str_004_027 CHAR(40);
  DCL shared_field_004_028 FIXED DEC(15,2);
  DCL shared_str_004_028 CHAR(40);
  DCL shared_field_004_029 FIXED DEC(15,2);
  DCL shared_str_004_029 CHAR(40);
