/*********************************************************************/
/* PNB Include 0011 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_011_000 FIXED DEC(15,2);
  DCL shared_str_011_000 CHAR(40);
  DCL shared_field_011_001 FIXED DEC(15,2);
  DCL shared_str_011_001 CHAR(40);
  DCL shared_field_011_002 FIXED DEC(15,2);
  DCL shared_str_011_002 CHAR(40);
  DCL shared_field_011_003 FIXED DEC(15,2);
  DCL shared_str_011_003 CHAR(40);
  DCL shared_field_011_004 FIXED DEC(15,2);
  DCL shared_str_011_004 CHAR(40);
  DCL shared_field_011_005 FIXED DEC(15,2);
  DCL shared_str_011_005 CHAR(40);
  DCL shared_field_011_006 FIXED DEC(15,2);
  DCL shared_str_011_006 CHAR(40);
  DCL shared_field_011_007 FIXED DEC(15,2);
  DCL shared_str_011_007 CHAR(40);
  DCL shared_field_011_008 FIXED DEC(15,2);
  DCL shared_str_011_008 CHAR(40);
  DCL shared_field_011_009 FIXED DEC(15,2);
  DCL shared_str_011_009 CHAR(40);
  DCL shared_field_011_010 FIXED DEC(15,2);
  DCL shared_str_011_010 CHAR(40);
  DCL shared_field_011_011 FIXED DEC(15,2);
  DCL shared_str_011_011 CHAR(40);
  DCL shared_field_011_012 FIXED DEC(15,2);
  DCL shared_str_011_012 CHAR(40);
  DCL shared_field_011_013 FIXED DEC(15,2);
  DCL shared_str_011_013 CHAR(40);
  DCL shared_field_011_014 FIXED DEC(15,2);
  DCL shared_str_011_014 CHAR(40);
  DCL shared_field_011_015 FIXED DEC(15,2);
  DCL shared_str_011_015 CHAR(40);
  DCL shared_field_011_016 FIXED DEC(15,2);
  DCL shared_str_011_016 CHAR(40);
  DCL shared_field_011_017 FIXED DEC(15,2);
  DCL shared_str_011_017 CHAR(40);
  DCL shared_field_011_018 FIXED DEC(15,2);
  DCL shared_str_011_018 CHAR(40);
  DCL shared_field_011_019 FIXED DEC(15,2);
  DCL shared_str_011_019 CHAR(40);
  DCL shared_field_011_020 FIXED DEC(15,2);
  DCL shared_str_011_020 CHAR(40);
  DCL shared_field_011_021 FIXED DEC(15,2);
  DCL shared_str_011_021 CHAR(40);
  DCL shared_field_011_022 FIXED DEC(15,2);
  DCL shared_str_011_022 CHAR(40);
  DCL shared_field_011_023 FIXED DEC(15,2);
  DCL shared_str_011_023 CHAR(40);
  DCL shared_field_011_024 FIXED DEC(15,2);
  DCL shared_str_011_024 CHAR(40);
  DCL shared_field_011_025 FIXED DEC(15,2);
  DCL shared_str_011_025 CHAR(40);
  DCL shared_field_011_026 FIXED DEC(15,2);
  DCL shared_str_011_026 CHAR(40);
  DCL shared_field_011_027 FIXED DEC(15,2);
  DCL shared_str_011_027 CHAR(40);
  DCL shared_field_011_028 FIXED DEC(15,2);
  DCL shared_str_011_028 CHAR(40);
  DCL shared_field_011_029 FIXED DEC(15,2);
  DCL shared_str_011_029 CHAR(40);
