/*********************************************************************/
/* PNB Include 0032 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_032_000 FIXED DEC(15,2);
  DCL shared_str_032_000 CHAR(40);
  DCL shared_field_032_001 FIXED DEC(15,2);
  DCL shared_str_032_001 CHAR(40);
  DCL shared_field_032_002 FIXED DEC(15,2);
  DCL shared_str_032_002 CHAR(40);
  DCL shared_field_032_003 FIXED DEC(15,2);
  DCL shared_str_032_003 CHAR(40);
  DCL shared_field_032_004 FIXED DEC(15,2);
  DCL shared_str_032_004 CHAR(40);
  DCL shared_field_032_005 FIXED DEC(15,2);
  DCL shared_str_032_005 CHAR(40);
  DCL shared_field_032_006 FIXED DEC(15,2);
  DCL shared_str_032_006 CHAR(40);
  DCL shared_field_032_007 FIXED DEC(15,2);
  DCL shared_str_032_007 CHAR(40);
  DCL shared_field_032_008 FIXED DEC(15,2);
  DCL shared_str_032_008 CHAR(40);
  DCL shared_field_032_009 FIXED DEC(15,2);
  DCL shared_str_032_009 CHAR(40);
  DCL shared_field_032_010 FIXED DEC(15,2);
  DCL shared_str_032_010 CHAR(40);
  DCL shared_field_032_011 FIXED DEC(15,2);
  DCL shared_str_032_011 CHAR(40);
  DCL shared_field_032_012 FIXED DEC(15,2);
  DCL shared_str_032_012 CHAR(40);
  DCL shared_field_032_013 FIXED DEC(15,2);
  DCL shared_str_032_013 CHAR(40);
  DCL shared_field_032_014 FIXED DEC(15,2);
  DCL shared_str_032_014 CHAR(40);
  DCL shared_field_032_015 FIXED DEC(15,2);
  DCL shared_str_032_015 CHAR(40);
  DCL shared_field_032_016 FIXED DEC(15,2);
  DCL shared_str_032_016 CHAR(40);
  DCL shared_field_032_017 FIXED DEC(15,2);
  DCL shared_str_032_017 CHAR(40);
  DCL shared_field_032_018 FIXED DEC(15,2);
  DCL shared_str_032_018 CHAR(40);
  DCL shared_field_032_019 FIXED DEC(15,2);
  DCL shared_str_032_019 CHAR(40);
  DCL shared_field_032_020 FIXED DEC(15,2);
  DCL shared_str_032_020 CHAR(40);
  DCL shared_field_032_021 FIXED DEC(15,2);
  DCL shared_str_032_021 CHAR(40);
  DCL shared_field_032_022 FIXED DEC(15,2);
  DCL shared_str_032_022 CHAR(40);
  DCL shared_field_032_023 FIXED DEC(15,2);
  DCL shared_str_032_023 CHAR(40);
  DCL shared_field_032_024 FIXED DEC(15,2);
  DCL shared_str_032_024 CHAR(40);
  DCL shared_field_032_025 FIXED DEC(15,2);
  DCL shared_str_032_025 CHAR(40);
  DCL shared_field_032_026 FIXED DEC(15,2);
  DCL shared_str_032_026 CHAR(40);
  DCL shared_field_032_027 FIXED DEC(15,2);
  DCL shared_str_032_027 CHAR(40);
  DCL shared_field_032_028 FIXED DEC(15,2);
  DCL shared_str_032_028 CHAR(40);
  DCL shared_field_032_029 FIXED DEC(15,2);
  DCL shared_str_032_029 CHAR(40);
