/*********************************************************************/
/* PNB Include 0017 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_017_000 FIXED DEC(15,2);
  DCL shared_str_017_000 CHAR(40);
  DCL shared_field_017_001 FIXED DEC(15,2);
  DCL shared_str_017_001 CHAR(40);
  DCL shared_field_017_002 FIXED DEC(15,2);
  DCL shared_str_017_002 CHAR(40);
  DCL shared_field_017_003 FIXED DEC(15,2);
  DCL shared_str_017_003 CHAR(40);
  DCL shared_field_017_004 FIXED DEC(15,2);
  DCL shared_str_017_004 CHAR(40);
  DCL shared_field_017_005 FIXED DEC(15,2);
  DCL shared_str_017_005 CHAR(40);
  DCL shared_field_017_006 FIXED DEC(15,2);
  DCL shared_str_017_006 CHAR(40);
  DCL shared_field_017_007 FIXED DEC(15,2);
  DCL shared_str_017_007 CHAR(40);
  DCL shared_field_017_008 FIXED DEC(15,2);
  DCL shared_str_017_008 CHAR(40);
  DCL shared_field_017_009 FIXED DEC(15,2);
  DCL shared_str_017_009 CHAR(40);
  DCL shared_field_017_010 FIXED DEC(15,2);
  DCL shared_str_017_010 CHAR(40);
  DCL shared_field_017_011 FIXED DEC(15,2);
  DCL shared_str_017_011 CHAR(40);
  DCL shared_field_017_012 FIXED DEC(15,2);
  DCL shared_str_017_012 CHAR(40);
  DCL shared_field_017_013 FIXED DEC(15,2);
  DCL shared_str_017_013 CHAR(40);
  DCL shared_field_017_014 FIXED DEC(15,2);
  DCL shared_str_017_014 CHAR(40);
  DCL shared_field_017_015 FIXED DEC(15,2);
  DCL shared_str_017_015 CHAR(40);
  DCL shared_field_017_016 FIXED DEC(15,2);
  DCL shared_str_017_016 CHAR(40);
  DCL shared_field_017_017 FIXED DEC(15,2);
  DCL shared_str_017_017 CHAR(40);
  DCL shared_field_017_018 FIXED DEC(15,2);
  DCL shared_str_017_018 CHAR(40);
  DCL shared_field_017_019 FIXED DEC(15,2);
  DCL shared_str_017_019 CHAR(40);
  DCL shared_field_017_020 FIXED DEC(15,2);
  DCL shared_str_017_020 CHAR(40);
  DCL shared_field_017_021 FIXED DEC(15,2);
  DCL shared_str_017_021 CHAR(40);
  DCL shared_field_017_022 FIXED DEC(15,2);
  DCL shared_str_017_022 CHAR(40);
  DCL shared_field_017_023 FIXED DEC(15,2);
  DCL shared_str_017_023 CHAR(40);
  DCL shared_field_017_024 FIXED DEC(15,2);
  DCL shared_str_017_024 CHAR(40);
  DCL shared_field_017_025 FIXED DEC(15,2);
  DCL shared_str_017_025 CHAR(40);
  DCL shared_field_017_026 FIXED DEC(15,2);
  DCL shared_str_017_026 CHAR(40);
  DCL shared_field_017_027 FIXED DEC(15,2);
  DCL shared_str_017_027 CHAR(40);
  DCL shared_field_017_028 FIXED DEC(15,2);
  DCL shared_str_017_028 CHAR(40);
  DCL shared_field_017_029 FIXED DEC(15,2);
  DCL shared_str_017_029 CHAR(40);
