/*********************************************************************/
/* PNB Include 0048 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_048_000 FIXED DEC(15,2);
  DCL shared_str_048_000 CHAR(40);
  DCL shared_field_048_001 FIXED DEC(15,2);
  DCL shared_str_048_001 CHAR(40);
  DCL shared_field_048_002 FIXED DEC(15,2);
  DCL shared_str_048_002 CHAR(40);
  DCL shared_field_048_003 FIXED DEC(15,2);
  DCL shared_str_048_003 CHAR(40);
  DCL shared_field_048_004 FIXED DEC(15,2);
  DCL shared_str_048_004 CHAR(40);
  DCL shared_field_048_005 FIXED DEC(15,2);
  DCL shared_str_048_005 CHAR(40);
  DCL shared_field_048_006 FIXED DEC(15,2);
  DCL shared_str_048_006 CHAR(40);
  DCL shared_field_048_007 FIXED DEC(15,2);
  DCL shared_str_048_007 CHAR(40);
  DCL shared_field_048_008 FIXED DEC(15,2);
  DCL shared_str_048_008 CHAR(40);
  DCL shared_field_048_009 FIXED DEC(15,2);
  DCL shared_str_048_009 CHAR(40);
  DCL shared_field_048_010 FIXED DEC(15,2);
  DCL shared_str_048_010 CHAR(40);
  DCL shared_field_048_011 FIXED DEC(15,2);
  DCL shared_str_048_011 CHAR(40);
  DCL shared_field_048_012 FIXED DEC(15,2);
  DCL shared_str_048_012 CHAR(40);
  DCL shared_field_048_013 FIXED DEC(15,2);
  DCL shared_str_048_013 CHAR(40);
  DCL shared_field_048_014 FIXED DEC(15,2);
  DCL shared_str_048_014 CHAR(40);
  DCL shared_field_048_015 FIXED DEC(15,2);
  DCL shared_str_048_015 CHAR(40);
  DCL shared_field_048_016 FIXED DEC(15,2);
  DCL shared_str_048_016 CHAR(40);
  DCL shared_field_048_017 FIXED DEC(15,2);
  DCL shared_str_048_017 CHAR(40);
  DCL shared_field_048_018 FIXED DEC(15,2);
  DCL shared_str_048_018 CHAR(40);
  DCL shared_field_048_019 FIXED DEC(15,2);
  DCL shared_str_048_019 CHAR(40);
  DCL shared_field_048_020 FIXED DEC(15,2);
  DCL shared_str_048_020 CHAR(40);
  DCL shared_field_048_021 FIXED DEC(15,2);
  DCL shared_str_048_021 CHAR(40);
  DCL shared_field_048_022 FIXED DEC(15,2);
  DCL shared_str_048_022 CHAR(40);
  DCL shared_field_048_023 FIXED DEC(15,2);
  DCL shared_str_048_023 CHAR(40);
  DCL shared_field_048_024 FIXED DEC(15,2);
  DCL shared_str_048_024 CHAR(40);
  DCL shared_field_048_025 FIXED DEC(15,2);
  DCL shared_str_048_025 CHAR(40);
  DCL shared_field_048_026 FIXED DEC(15,2);
  DCL shared_str_048_026 CHAR(40);
  DCL shared_field_048_027 FIXED DEC(15,2);
  DCL shared_str_048_027 CHAR(40);
  DCL shared_field_048_028 FIXED DEC(15,2);
  DCL shared_str_048_028 CHAR(40);
  DCL shared_field_048_029 FIXED DEC(15,2);
  DCL shared_str_048_029 CHAR(40);
