/*********************************************************************/
/* PNB Include 0025 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_025_000 FIXED DEC(15,2);
  DCL shared_str_025_000 CHAR(40);
  DCL shared_field_025_001 FIXED DEC(15,2);
  DCL shared_str_025_001 CHAR(40);
  DCL shared_field_025_002 FIXED DEC(15,2);
  DCL shared_str_025_002 CHAR(40);
  DCL shared_field_025_003 FIXED DEC(15,2);
  DCL shared_str_025_003 CHAR(40);
  DCL shared_field_025_004 FIXED DEC(15,2);
  DCL shared_str_025_004 CHAR(40);
  DCL shared_field_025_005 FIXED DEC(15,2);
  DCL shared_str_025_005 CHAR(40);
  DCL shared_field_025_006 FIXED DEC(15,2);
  DCL shared_str_025_006 CHAR(40);
  DCL shared_field_025_007 FIXED DEC(15,2);
  DCL shared_str_025_007 CHAR(40);
  DCL shared_field_025_008 FIXED DEC(15,2);
  DCL shared_str_025_008 CHAR(40);
  DCL shared_field_025_009 FIXED DEC(15,2);
  DCL shared_str_025_009 CHAR(40);
  DCL shared_field_025_010 FIXED DEC(15,2);
  DCL shared_str_025_010 CHAR(40);
  DCL shared_field_025_011 FIXED DEC(15,2);
  DCL shared_str_025_011 CHAR(40);
  DCL shared_field_025_012 FIXED DEC(15,2);
  DCL shared_str_025_012 CHAR(40);
  DCL shared_field_025_013 FIXED DEC(15,2);
  DCL shared_str_025_013 CHAR(40);
  DCL shared_field_025_014 FIXED DEC(15,2);
  DCL shared_str_025_014 CHAR(40);
  DCL shared_field_025_015 FIXED DEC(15,2);
  DCL shared_str_025_015 CHAR(40);
  DCL shared_field_025_016 FIXED DEC(15,2);
  DCL shared_str_025_016 CHAR(40);
  DCL shared_field_025_017 FIXED DEC(15,2);
  DCL shared_str_025_017 CHAR(40);
  DCL shared_field_025_018 FIXED DEC(15,2);
  DCL shared_str_025_018 CHAR(40);
  DCL shared_field_025_019 FIXED DEC(15,2);
  DCL shared_str_025_019 CHAR(40);
  DCL shared_field_025_020 FIXED DEC(15,2);
  DCL shared_str_025_020 CHAR(40);
  DCL shared_field_025_021 FIXED DEC(15,2);
  DCL shared_str_025_021 CHAR(40);
  DCL shared_field_025_022 FIXED DEC(15,2);
  DCL shared_str_025_022 CHAR(40);
  DCL shared_field_025_023 FIXED DEC(15,2);
  DCL shared_str_025_023 CHAR(40);
  DCL shared_field_025_024 FIXED DEC(15,2);
  DCL shared_str_025_024 CHAR(40);
  DCL shared_field_025_025 FIXED DEC(15,2);
  DCL shared_str_025_025 CHAR(40);
  DCL shared_field_025_026 FIXED DEC(15,2);
  DCL shared_str_025_026 CHAR(40);
  DCL shared_field_025_027 FIXED DEC(15,2);
  DCL shared_str_025_027 CHAR(40);
  DCL shared_field_025_028 FIXED DEC(15,2);
  DCL shared_str_025_028 CHAR(40);
  DCL shared_field_025_029 FIXED DEC(15,2);
  DCL shared_str_025_029 CHAR(40);
