/*********************************************************************/
/* PNB Include 0040 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_040_000 FIXED DEC(15,2);
  DCL shared_str_040_000 CHAR(40);
  DCL shared_field_040_001 FIXED DEC(15,2);
  DCL shared_str_040_001 CHAR(40);
  DCL shared_field_040_002 FIXED DEC(15,2);
  DCL shared_str_040_002 CHAR(40);
  DCL shared_field_040_003 FIXED DEC(15,2);
  DCL shared_str_040_003 CHAR(40);
  DCL shared_field_040_004 FIXED DEC(15,2);
  DCL shared_str_040_004 CHAR(40);
  DCL shared_field_040_005 FIXED DEC(15,2);
  DCL shared_str_040_005 CHAR(40);
  DCL shared_field_040_006 FIXED DEC(15,2);
  DCL shared_str_040_006 CHAR(40);
  DCL shared_field_040_007 FIXED DEC(15,2);
  DCL shared_str_040_007 CHAR(40);
  DCL shared_field_040_008 FIXED DEC(15,2);
  DCL shared_str_040_008 CHAR(40);
  DCL shared_field_040_009 FIXED DEC(15,2);
  DCL shared_str_040_009 CHAR(40);
  DCL shared_field_040_010 FIXED DEC(15,2);
  DCL shared_str_040_010 CHAR(40);
  DCL shared_field_040_011 FIXED DEC(15,2);
  DCL shared_str_040_011 CHAR(40);
  DCL shared_field_040_012 FIXED DEC(15,2);
  DCL shared_str_040_012 CHAR(40);
  DCL shared_field_040_013 FIXED DEC(15,2);
  DCL shared_str_040_013 CHAR(40);
  DCL shared_field_040_014 FIXED DEC(15,2);
  DCL shared_str_040_014 CHAR(40);
  DCL shared_field_040_015 FIXED DEC(15,2);
  DCL shared_str_040_015 CHAR(40);
  DCL shared_field_040_016 FIXED DEC(15,2);
  DCL shared_str_040_016 CHAR(40);
  DCL shared_field_040_017 FIXED DEC(15,2);
  DCL shared_str_040_017 CHAR(40);
  DCL shared_field_040_018 FIXED DEC(15,2);
  DCL shared_str_040_018 CHAR(40);
  DCL shared_field_040_019 FIXED DEC(15,2);
  DCL shared_str_040_019 CHAR(40);
  DCL shared_field_040_020 FIXED DEC(15,2);
  DCL shared_str_040_020 CHAR(40);
  DCL shared_field_040_021 FIXED DEC(15,2);
  DCL shared_str_040_021 CHAR(40);
  DCL shared_field_040_022 FIXED DEC(15,2);
  DCL shared_str_040_022 CHAR(40);
  DCL shared_field_040_023 FIXED DEC(15,2);
  DCL shared_str_040_023 CHAR(40);
  DCL shared_field_040_024 FIXED DEC(15,2);
  DCL shared_str_040_024 CHAR(40);
  DCL shared_field_040_025 FIXED DEC(15,2);
  DCL shared_str_040_025 CHAR(40);
  DCL shared_field_040_026 FIXED DEC(15,2);
  DCL shared_str_040_026 CHAR(40);
  DCL shared_field_040_027 FIXED DEC(15,2);
  DCL shared_str_040_027 CHAR(40);
  DCL shared_field_040_028 FIXED DEC(15,2);
  DCL shared_str_040_028 CHAR(40);
  DCL shared_field_040_029 FIXED DEC(15,2);
  DCL shared_str_040_029 CHAR(40);
