/*********************************************************************/
/* PNB Include 0035 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_035_000 FIXED DEC(15,2);
  DCL shared_str_035_000 CHAR(40);
  DCL shared_field_035_001 FIXED DEC(15,2);
  DCL shared_str_035_001 CHAR(40);
  DCL shared_field_035_002 FIXED DEC(15,2);
  DCL shared_str_035_002 CHAR(40);
  DCL shared_field_035_003 FIXED DEC(15,2);
  DCL shared_str_035_003 CHAR(40);
  DCL shared_field_035_004 FIXED DEC(15,2);
  DCL shared_str_035_004 CHAR(40);
  DCL shared_field_035_005 FIXED DEC(15,2);
  DCL shared_str_035_005 CHAR(40);
  DCL shared_field_035_006 FIXED DEC(15,2);
  DCL shared_str_035_006 CHAR(40);
  DCL shared_field_035_007 FIXED DEC(15,2);
  DCL shared_str_035_007 CHAR(40);
  DCL shared_field_035_008 FIXED DEC(15,2);
  DCL shared_str_035_008 CHAR(40);
  DCL shared_field_035_009 FIXED DEC(15,2);
  DCL shared_str_035_009 CHAR(40);
  DCL shared_field_035_010 FIXED DEC(15,2);
  DCL shared_str_035_010 CHAR(40);
  DCL shared_field_035_011 FIXED DEC(15,2);
  DCL shared_str_035_011 CHAR(40);
  DCL shared_field_035_012 FIXED DEC(15,2);
  DCL shared_str_035_012 CHAR(40);
  DCL shared_field_035_013 FIXED DEC(15,2);
  DCL shared_str_035_013 CHAR(40);
  DCL shared_field_035_014 FIXED DEC(15,2);
  DCL shared_str_035_014 CHAR(40);
  DCL shared_field_035_015 FIXED DEC(15,2);
  DCL shared_str_035_015 CHAR(40);
  DCL shared_field_035_016 FIXED DEC(15,2);
  DCL shared_str_035_016 CHAR(40);
  DCL shared_field_035_017 FIXED DEC(15,2);
  DCL shared_str_035_017 CHAR(40);
  DCL shared_field_035_018 FIXED DEC(15,2);
  DCL shared_str_035_018 CHAR(40);
  DCL shared_field_035_019 FIXED DEC(15,2);
  DCL shared_str_035_019 CHAR(40);
  DCL shared_field_035_020 FIXED DEC(15,2);
  DCL shared_str_035_020 CHAR(40);
  DCL shared_field_035_021 FIXED DEC(15,2);
  DCL shared_str_035_021 CHAR(40);
  DCL shared_field_035_022 FIXED DEC(15,2);
  DCL shared_str_035_022 CHAR(40);
  DCL shared_field_035_023 FIXED DEC(15,2);
  DCL shared_str_035_023 CHAR(40);
  DCL shared_field_035_024 FIXED DEC(15,2);
  DCL shared_str_035_024 CHAR(40);
  DCL shared_field_035_025 FIXED DEC(15,2);
  DCL shared_str_035_025 CHAR(40);
  DCL shared_field_035_026 FIXED DEC(15,2);
  DCL shared_str_035_026 CHAR(40);
  DCL shared_field_035_027 FIXED DEC(15,2);
  DCL shared_str_035_027 CHAR(40);
  DCL shared_field_035_028 FIXED DEC(15,2);
  DCL shared_str_035_028 CHAR(40);
  DCL shared_field_035_029 FIXED DEC(15,2);
  DCL shared_str_035_029 CHAR(40);
