/*********************************************************************/
/* PNB Include 0010 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_010_000 FIXED DEC(15,2);
  DCL shared_str_010_000 CHAR(40);
  DCL shared_field_010_001 FIXED DEC(15,2);
  DCL shared_str_010_001 CHAR(40);
  DCL shared_field_010_002 FIXED DEC(15,2);
  DCL shared_str_010_002 CHAR(40);
  DCL shared_field_010_003 FIXED DEC(15,2);
  DCL shared_str_010_003 CHAR(40);
  DCL shared_field_010_004 FIXED DEC(15,2);
  DCL shared_str_010_004 CHAR(40);
  DCL shared_field_010_005 FIXED DEC(15,2);
  DCL shared_str_010_005 CHAR(40);
  DCL shared_field_010_006 FIXED DEC(15,2);
  DCL shared_str_010_006 CHAR(40);
  DCL shared_field_010_007 FIXED DEC(15,2);
  DCL shared_str_010_007 CHAR(40);
  DCL shared_field_010_008 FIXED DEC(15,2);
  DCL shared_str_010_008 CHAR(40);
  DCL shared_field_010_009 FIXED DEC(15,2);
  DCL shared_str_010_009 CHAR(40);
  DCL shared_field_010_010 FIXED DEC(15,2);
  DCL shared_str_010_010 CHAR(40);
  DCL shared_field_010_011 FIXED DEC(15,2);
  DCL shared_str_010_011 CHAR(40);
  DCL shared_field_010_012 FIXED DEC(15,2);
  DCL shared_str_010_012 CHAR(40);
  DCL shared_field_010_013 FIXED DEC(15,2);
  DCL shared_str_010_013 CHAR(40);
  DCL shared_field_010_014 FIXED DEC(15,2);
  DCL shared_str_010_014 CHAR(40);
  DCL shared_field_010_015 FIXED DEC(15,2);
  DCL shared_str_010_015 CHAR(40);
  DCL shared_field_010_016 FIXED DEC(15,2);
  DCL shared_str_010_016 CHAR(40);
  DCL shared_field_010_017 FIXED DEC(15,2);
  DCL shared_str_010_017 CHAR(40);
  DCL shared_field_010_018 FIXED DEC(15,2);
  DCL shared_str_010_018 CHAR(40);
  DCL shared_field_010_019 FIXED DEC(15,2);
  DCL shared_str_010_019 CHAR(40);
  DCL shared_field_010_020 FIXED DEC(15,2);
  DCL shared_str_010_020 CHAR(40);
  DCL shared_field_010_021 FIXED DEC(15,2);
  DCL shared_str_010_021 CHAR(40);
  DCL shared_field_010_022 FIXED DEC(15,2);
  DCL shared_str_010_022 CHAR(40);
  DCL shared_field_010_023 FIXED DEC(15,2);
  DCL shared_str_010_023 CHAR(40);
  DCL shared_field_010_024 FIXED DEC(15,2);
  DCL shared_str_010_024 CHAR(40);
  DCL shared_field_010_025 FIXED DEC(15,2);
  DCL shared_str_010_025 CHAR(40);
  DCL shared_field_010_026 FIXED DEC(15,2);
  DCL shared_str_010_026 CHAR(40);
  DCL shared_field_010_027 FIXED DEC(15,2);
  DCL shared_str_010_027 CHAR(40);
  DCL shared_field_010_028 FIXED DEC(15,2);
  DCL shared_str_010_028 CHAR(40);
  DCL shared_field_010_029 FIXED DEC(15,2);
  DCL shared_str_010_029 CHAR(40);
