/*********************************************************************/
/* PNB Include 0041 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_041_000 FIXED DEC(15,2);
  DCL shared_str_041_000 CHAR(40);
  DCL shared_field_041_001 FIXED DEC(15,2);
  DCL shared_str_041_001 CHAR(40);
  DCL shared_field_041_002 FIXED DEC(15,2);
  DCL shared_str_041_002 CHAR(40);
  DCL shared_field_041_003 FIXED DEC(15,2);
  DCL shared_str_041_003 CHAR(40);
  DCL shared_field_041_004 FIXED DEC(15,2);
  DCL shared_str_041_004 CHAR(40);
  DCL shared_field_041_005 FIXED DEC(15,2);
  DCL shared_str_041_005 CHAR(40);
  DCL shared_field_041_006 FIXED DEC(15,2);
  DCL shared_str_041_006 CHAR(40);
  DCL shared_field_041_007 FIXED DEC(15,2);
  DCL shared_str_041_007 CHAR(40);
  DCL shared_field_041_008 FIXED DEC(15,2);
  DCL shared_str_041_008 CHAR(40);
  DCL shared_field_041_009 FIXED DEC(15,2);
  DCL shared_str_041_009 CHAR(40);
  DCL shared_field_041_010 FIXED DEC(15,2);
  DCL shared_str_041_010 CHAR(40);
  DCL shared_field_041_011 FIXED DEC(15,2);
  DCL shared_str_041_011 CHAR(40);
  DCL shared_field_041_012 FIXED DEC(15,2);
  DCL shared_str_041_012 CHAR(40);
  DCL shared_field_041_013 FIXED DEC(15,2);
  DCL shared_str_041_013 CHAR(40);
  DCL shared_field_041_014 FIXED DEC(15,2);
  DCL shared_str_041_014 CHAR(40);
  DCL shared_field_041_015 FIXED DEC(15,2);
  DCL shared_str_041_015 CHAR(40);
  DCL shared_field_041_016 FIXED DEC(15,2);
  DCL shared_str_041_016 CHAR(40);
  DCL shared_field_041_017 FIXED DEC(15,2);
  DCL shared_str_041_017 CHAR(40);
  DCL shared_field_041_018 FIXED DEC(15,2);
  DCL shared_str_041_018 CHAR(40);
  DCL shared_field_041_019 FIXED DEC(15,2);
  DCL shared_str_041_019 CHAR(40);
  DCL shared_field_041_020 FIXED DEC(15,2);
  DCL shared_str_041_020 CHAR(40);
  DCL shared_field_041_021 FIXED DEC(15,2);
  DCL shared_str_041_021 CHAR(40);
  DCL shared_field_041_022 FIXED DEC(15,2);
  DCL shared_str_041_022 CHAR(40);
  DCL shared_field_041_023 FIXED DEC(15,2);
  DCL shared_str_041_023 CHAR(40);
  DCL shared_field_041_024 FIXED DEC(15,2);
  DCL shared_str_041_024 CHAR(40);
  DCL shared_field_041_025 FIXED DEC(15,2);
  DCL shared_str_041_025 CHAR(40);
  DCL shared_field_041_026 FIXED DEC(15,2);
  DCL shared_str_041_026 CHAR(40);
  DCL shared_field_041_027 FIXED DEC(15,2);
  DCL shared_str_041_027 CHAR(40);
  DCL shared_field_041_028 FIXED DEC(15,2);
  DCL shared_str_041_028 CHAR(40);
  DCL shared_field_041_029 FIXED DEC(15,2);
  DCL shared_str_041_029 CHAR(40);
