/*********************************************************************/
/* PNB Include 0018 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_018_000 FIXED DEC(15,2);
  DCL shared_str_018_000 CHAR(40);
  DCL shared_field_018_001 FIXED DEC(15,2);
  DCL shared_str_018_001 CHAR(40);
  DCL shared_field_018_002 FIXED DEC(15,2);
  DCL shared_str_018_002 CHAR(40);
  DCL shared_field_018_003 FIXED DEC(15,2);
  DCL shared_str_018_003 CHAR(40);
  DCL shared_field_018_004 FIXED DEC(15,2);
  DCL shared_str_018_004 CHAR(40);
  DCL shared_field_018_005 FIXED DEC(15,2);
  DCL shared_str_018_005 CHAR(40);
  DCL shared_field_018_006 FIXED DEC(15,2);
  DCL shared_str_018_006 CHAR(40);
  DCL shared_field_018_007 FIXED DEC(15,2);
  DCL shared_str_018_007 CHAR(40);
  DCL shared_field_018_008 FIXED DEC(15,2);
  DCL shared_str_018_008 CHAR(40);
  DCL shared_field_018_009 FIXED DEC(15,2);
  DCL shared_str_018_009 CHAR(40);
  DCL shared_field_018_010 FIXED DEC(15,2);
  DCL shared_str_018_010 CHAR(40);
  DCL shared_field_018_011 FIXED DEC(15,2);
  DCL shared_str_018_011 CHAR(40);
  DCL shared_field_018_012 FIXED DEC(15,2);
  DCL shared_str_018_012 CHAR(40);
  DCL shared_field_018_013 FIXED DEC(15,2);
  DCL shared_str_018_013 CHAR(40);
  DCL shared_field_018_014 FIXED DEC(15,2);
  DCL shared_str_018_014 CHAR(40);
  DCL shared_field_018_015 FIXED DEC(15,2);
  DCL shared_str_018_015 CHAR(40);
  DCL shared_field_018_016 FIXED DEC(15,2);
  DCL shared_str_018_016 CHAR(40);
  DCL shared_field_018_017 FIXED DEC(15,2);
  DCL shared_str_018_017 CHAR(40);
  DCL shared_field_018_018 FIXED DEC(15,2);
  DCL shared_str_018_018 CHAR(40);
  DCL shared_field_018_019 FIXED DEC(15,2);
  DCL shared_str_018_019 CHAR(40);
  DCL shared_field_018_020 FIXED DEC(15,2);
  DCL shared_str_018_020 CHAR(40);
  DCL shared_field_018_021 FIXED DEC(15,2);
  DCL shared_str_018_021 CHAR(40);
  DCL shared_field_018_022 FIXED DEC(15,2);
  DCL shared_str_018_022 CHAR(40);
  DCL shared_field_018_023 FIXED DEC(15,2);
  DCL shared_str_018_023 CHAR(40);
  DCL shared_field_018_024 FIXED DEC(15,2);
  DCL shared_str_018_024 CHAR(40);
  DCL shared_field_018_025 FIXED DEC(15,2);
  DCL shared_str_018_025 CHAR(40);
  DCL shared_field_018_026 FIXED DEC(15,2);
  DCL shared_str_018_026 CHAR(40);
  DCL shared_field_018_027 FIXED DEC(15,2);
  DCL shared_str_018_027 CHAR(40);
  DCL shared_field_018_028 FIXED DEC(15,2);
  DCL shared_str_018_028 CHAR(40);
  DCL shared_field_018_029 FIXED DEC(15,2);
  DCL shared_str_018_029 CHAR(40);
