/*********************************************************************/
/* PNB Include 0005 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_005_000 FIXED DEC(15,2);
  DCL shared_str_005_000 CHAR(40);
  DCL shared_field_005_001 FIXED DEC(15,2);
  DCL shared_str_005_001 CHAR(40);
  DCL shared_field_005_002 FIXED DEC(15,2);
  DCL shared_str_005_002 CHAR(40);
  DCL shared_field_005_003 FIXED DEC(15,2);
  DCL shared_str_005_003 CHAR(40);
  DCL shared_field_005_004 FIXED DEC(15,2);
  DCL shared_str_005_004 CHAR(40);
  DCL shared_field_005_005 FIXED DEC(15,2);
  DCL shared_str_005_005 CHAR(40);
  DCL shared_field_005_006 FIXED DEC(15,2);
  DCL shared_str_005_006 CHAR(40);
  DCL shared_field_005_007 FIXED DEC(15,2);
  DCL shared_str_005_007 CHAR(40);
  DCL shared_field_005_008 FIXED DEC(15,2);
  DCL shared_str_005_008 CHAR(40);
  DCL shared_field_005_009 FIXED DEC(15,2);
  DCL shared_str_005_009 CHAR(40);
  DCL shared_field_005_010 FIXED DEC(15,2);
  DCL shared_str_005_010 CHAR(40);
  DCL shared_field_005_011 FIXED DEC(15,2);
  DCL shared_str_005_011 CHAR(40);
  DCL shared_field_005_012 FIXED DEC(15,2);
  DCL shared_str_005_012 CHAR(40);
  DCL shared_field_005_013 FIXED DEC(15,2);
  DCL shared_str_005_013 CHAR(40);
  DCL shared_field_005_014 FIXED DEC(15,2);
  DCL shared_str_005_014 CHAR(40);
  DCL shared_field_005_015 FIXED DEC(15,2);
  DCL shared_str_005_015 CHAR(40);
  DCL shared_field_005_016 FIXED DEC(15,2);
  DCL shared_str_005_016 CHAR(40);
  DCL shared_field_005_017 FIXED DEC(15,2);
  DCL shared_str_005_017 CHAR(40);
  DCL shared_field_005_018 FIXED DEC(15,2);
  DCL shared_str_005_018 CHAR(40);
  DCL shared_field_005_019 FIXED DEC(15,2);
  DCL shared_str_005_019 CHAR(40);
  DCL shared_field_005_020 FIXED DEC(15,2);
  DCL shared_str_005_020 CHAR(40);
  DCL shared_field_005_021 FIXED DEC(15,2);
  DCL shared_str_005_021 CHAR(40);
  DCL shared_field_005_022 FIXED DEC(15,2);
  DCL shared_str_005_022 CHAR(40);
  DCL shared_field_005_023 FIXED DEC(15,2);
  DCL shared_str_005_023 CHAR(40);
  DCL shared_field_005_024 FIXED DEC(15,2);
  DCL shared_str_005_024 CHAR(40);
  DCL shared_field_005_025 FIXED DEC(15,2);
  DCL shared_str_005_025 CHAR(40);
  DCL shared_field_005_026 FIXED DEC(15,2);
  DCL shared_str_005_026 CHAR(40);
  DCL shared_field_005_027 FIXED DEC(15,2);
  DCL shared_str_005_027 CHAR(40);
  DCL shared_field_005_028 FIXED DEC(15,2);
  DCL shared_str_005_028 CHAR(40);
  DCL shared_field_005_029 FIXED DEC(15,2);
  DCL shared_str_005_029 CHAR(40);
