/*********************************************************************/
/* PNB Include 0006 — Shared declarations                          */
/*********************************************************************/
  DCL shared_field_006_000 FIXED DEC(15,2);
  DCL shared_str_006_000 CHAR(40);
  DCL shared_field_006_001 FIXED DEC(15,2);
  DCL shared_str_006_001 CHAR(40);
  DCL shared_field_006_002 FIXED DEC(15,2);
  DCL shared_str_006_002 CHAR(40);
  DCL shared_field_006_003 FIXED DEC(15,2);
  DCL shared_str_006_003 CHAR(40);
  DCL shared_field_006_004 FIXED DEC(15,2);
  DCL shared_str_006_004 CHAR(40);
  DCL shared_field_006_005 FIXED DEC(15,2);
  DCL shared_str_006_005 CHAR(40);
  DCL shared_field_006_006 FIXED DEC(15,2);
  DCL shared_str_006_006 CHAR(40);
  DCL shared_field_006_007 FIXED DEC(15,2);
  DCL shared_str_006_007 CHAR(40);
  DCL shared_field_006_008 FIXED DEC(15,2);
  DCL shared_str_006_008 CHAR(40);
  DCL shared_field_006_009 FIXED DEC(15,2);
  DCL shared_str_006_009 CHAR(40);
  DCL shared_field_006_010 FIXED DEC(15,2);
  DCL shared_str_006_010 CHAR(40);
  DCL shared_field_006_011 FIXED DEC(15,2);
  DCL shared_str_006_011 CHAR(40);
  DCL shared_field_006_012 FIXED DEC(15,2);
  DCL shared_str_006_012 CHAR(40);
  DCL shared_field_006_013 FIXED DEC(15,2);
  DCL shared_str_006_013 CHAR(40);
  DCL shared_field_006_014 FIXED DEC(15,2);
  DCL shared_str_006_014 CHAR(40);
  DCL shared_field_006_015 FIXED DEC(15,2);
  DCL shared_str_006_015 CHAR(40);
  DCL shared_field_006_016 FIXED DEC(15,2);
  DCL shared_str_006_016 CHAR(40);
  DCL shared_field_006_017 FIXED DEC(15,2);
  DCL shared_str_006_017 CHAR(40);
  DCL shared_field_006_018 FIXED DEC(15,2);
  DCL shared_str_006_018 CHAR(40);
  DCL shared_field_006_019 FIXED DEC(15,2);
  DCL shared_str_006_019 CHAR(40);
  DCL shared_field_006_020 FIXED DEC(15,2);
  DCL shared_str_006_020 CHAR(40);
  DCL shared_field_006_021 FIXED DEC(15,2);
  DCL shared_str_006_021 CHAR(40);
  DCL shared_field_006_022 FIXED DEC(15,2);
  DCL shared_str_006_022 CHAR(40);
  DCL shared_field_006_023 FIXED DEC(15,2);
  DCL shared_str_006_023 CHAR(40);
  DCL shared_field_006_024 FIXED DEC(15,2);
  DCL shared_str_006_024 CHAR(40);
  DCL shared_field_006_025 FIXED DEC(15,2);
  DCL shared_str_006_025 CHAR(40);
  DCL shared_field_006_026 FIXED DEC(15,2);
  DCL shared_str_006_026 CHAR(40);
  DCL shared_field_006_027 FIXED DEC(15,2);
  DCL shared_str_006_027 CHAR(40);
  DCL shared_field_006_028 FIXED DEC(15,2);
  DCL shared_str_006_028 CHAR(40);
  DCL shared_field_006_029 FIXED DEC(15,2);
  DCL shared_str_006_029 CHAR(40);
